
Процедура ЗаписатьПрефиксИБ(Знач ПрефиксИБ) Экспорт
	
	Если НЕ ПустаяСтрока(ПрефиксИБ) Тогда
		
		Запись = РегистрыСведений.ПрефиксыИнформационныхБаз.СоздатьМенеджерЗаписи();
		Запись.Префикс = ПрефиксИБ;
		Запись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в регистр сведений ПрефиксыИнформационныхБаз 
// значение константы ПрефиксУзлаРаспределеннойИнформационнойБазы.
//
Процедура ДобавитьЗначениеКонстантыПрефиксУзлаРаспределеннойИнформационнойБазы() Экспорт
	
	Попытка
		
		ПрефиксУзлаРаспределеннойИнформационнойБазы = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить();	
		ЗаписатьПрефиксИБ(ПрефиксУзлаРаспределеннойИнформационнойБазы);
				
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий = НСтр(
		"ru = 'При записи значения константы ""ПрефиксУзлаРаспределеннойИнформационнойБазы"" в регистр сведений ""ПрефиксыИнформационныхБаз"" произошла ошибка:
		|%1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы'"), УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
		
	КонецПопытки;
	
КонецПроцедуры
