
Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002006Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Форма адаптирована к версии ЭФНО 1.6.1.29 от 07.08.2008г.";
	НоваяФорма.ДатаНачалоДействия = '20060101';
	НоваяФорма.ДатаКонецДействия  = '20061231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002007Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Форма адаптирована к версии ЭФНО 1.6.1.29 от 07.08.2008г.";
	НоваяФорма.ДатаНачалоДействия = '20070101';
	НоваяФорма.ДатаКонецДействия  = '20071231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002008Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Форма адаптирована к версии ЭФНО 1.6.1.47 от 01.04.2009г.";
	НоваяФорма.ДатаНачалоДействия = '20080101';
	НоваяФорма.ДатаКонецДействия  = '20081231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002009Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Форма имеет возможность выгрузки в ИС СОНО 3.119.99, версия ФНО: 100.00.v14.r28 от 19.02.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20090101';
	НоваяФорма.ДатаКонецДействия  = '20091231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002010Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v17.r45 от 10.09.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20100101';
	НоваяФорма.ДатаКонецДействия  = '20101231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002011Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v18.r57 от 11.04.2011";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20111231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002012Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v19.r66 от 29.12.2011";
	НоваяФорма.ДатаНачалоДействия = '20120101';
	НоваяФорма.ДатаКонецДействия  = '20121231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002013Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v21.r79 от 26.11.2013";
	НоваяФорма.ДатаНачалоДействия = '20130101';
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002014Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v22.r83 от 31.12.2013";
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002015Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v24.r86 от 04.07.2015";
	НоваяФорма.ДатаНачалоДействия = '20150101';
	НоваяФорма.ДатаКонецДействия  = '20151231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002016Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v25.r87 от 24.12.2015";
	НоваяФорма.ДатаНачалоДействия = '20160101';
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002017Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v26.r88 от 29.12.2016";
	НоваяФорма.ДатаНачалоДействия = '20170101';
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002018Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v27.r90 от 28.06.2018";
	НоваяФорма.ДатаНачалоДействия = '20180101';
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002019Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v28.r104 от 21.12.2020";
	НоваяФорма.ДатаНачалоДействия = '20190101';
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002020Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v28.r104 от 21.12.2020";
	НоваяФорма.ДатаНачалоДействия = '20200101';
	НоваяФорма.ДатаКонецДействия  = '20201231';
	
	//НоваяФорма = ТаблицаФормОтчета.Добавить();
	//НоваяФорма.ФормаОтчета        = "Форма1002021Кв4";
	//НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v29.r109 от 23.12.2021";
	//НоваяФорма.ДатаНачалоДействия = '20210101';
	//НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002022Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v31.r126 от 16.06.2023";
	НоваяФорма.ДатаНачалоДействия = '20210101';
	НоваяФорма.ДатаКонецДействия  = '20221231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма1002023Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v32.r149 от 26.12.2023";
	НоваяФорма.ДатаНачалоДействия = '20230101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

