
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Загрузка с сервера всех карточек, принадлежащих организации. Возможно потребуется отдельная форма получения, как у документов ИСМПТ (может быть получится использовать ту же форму)
	//При получении данных должен заполняться регистр, при этом выполняться поиск и заполнение дополнительных данных (которые не приходят с сервера):
	//Организация и ИИН - определять по принадлежности ключа, с которым выполняется получение. Если не получится, то по указанным данным в форме получения.
	//ЕАН - получать из джитин, который приходит с сервера
	//Номенклатура - подбирать по джитин (ЕАН) из регистра штрихкодов
	//Характеристика - также из регистра штрихкодов при определении номенклатуры
	//ЕдиницаИзмерения - из регистра штрихкодов, если заполнена упаковка, если нет упаковки - базовой ЕИ номенклатуры
	//ВидПродукции - по особенностям учета подобранной номенклатуры
	//Остальные поля должны приходить с сервера.
	//Ресурс КарточкаЗаполнена должен выставляться в ИСТИНА только если получилось заполнить поля Организация, Номенклатура, ВидПродукции. Если какое-то из них подобрать не удалось, оставляем значение Ложь.
	
	//Доступ к команде: в форме списка регистра и в форме обработки ПанельОбменИСМПТК на вкладке Нац.каталог
	
	Тест = Истина;
	
КонецПроцедуры
