#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьКорреспонденциюПроводок() Экспорт
	
	МакетСчетов = Справочники.КорреспонденцииСчетов.ПолучитьМакет("Макет");
	НомерСтроки = 1;
			
	Пока Истина Цикл
		
		Номер = МакетСчетов.Область(НомерСтроки,1).Текст;
		Если НЕ ЗначениеЗаполнено(Номер) Тогда			
			Прервать;
		КонецЕсли;
		
		СчетДт = ПланыСчетов.Типовой.НайтиПоКоду(МакетСчетов.область(НомерСтроки,3).Текст);
		СчетКт = ПланыСчетов.Типовой.НайтиПоКоду(МакетСчетов.область(НомерСтроки,4).Текст);
		
		ЗаписьКорреспонденцииСчетов = РегистрыСведений.КорректныеКорреспонденцииСчетов.СоздатьМенеджерЗаписи();		
		ЗаписьКорреспонденцииСчетов.СчетДт = СчетДт;
		ЗаписьКорреспонденцииСчетов.СчетКт = СчетКт;                                                           		
		ЗаписьКорреспонденцииСчетов.Прочитать();		
		
		ЗаписьСуществует = ЗаписьКорреспонденцииСчетов.Выбран();
		
		Если Не ЗаписьСуществует Тогда		
			ЗаписьКорреспонденцииСчетов.СчетДт = СчетДт;
			ЗаписьКорреспонденцииСчетов.СчетКт = СчетКт;
			ЗаписьКорреспонденцииСчетов.Комментарий 		  = МакетСчетов.Область(НомерСтроки,2).Текст;
			
			ЗаписьКорреспонденцииСчетов.Записать(Истина);
		КонецЕсли;	
		
		НомерСтроки = НомерСтроки+1;
		
	КонецЦикла;  
	
КонецПроцедуры

#КонецЕсли