
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Черновик);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отправлен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОжидаетПриемку);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ПринятПодтвержден);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отклонен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отозван);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Аннулирован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.НаСогласовании);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Ошибка);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Новое);
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Проверяется);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Оформлен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОшибкаПриПроверке);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОшибкаПриОбработке);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.НеОпределен);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
