#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыВычетовИПН();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыВычетовИПН()
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();

	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный1МЗП, 	  Перечисления.ВидыПределовВычетовИКорректировокДоходов.МЗП, 1);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.НаОплатуМедицинскихУслуг, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный75МЗПИнвалиды, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный75МЗПРодители, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20220101', Справочники.ВычетыИПН.Стандартный1МЗП, 		  Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 14);
    
    НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерВычетаИПН(НаборЗаписей, Период, ВидВычетаИПН, ВидПределаВычета, Размер) Экспорт
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидВычетаИПН = ВидВычетаИПН;
	НоваяЗапись.ВидПределаВычета = ВидПределаВычета;
	НоваяЗапись.Размер = Размер;
	
КонецПроцедуры	

Процедура ОбновитьРазмерыВычетовИПН2022() Экспорт
	
	ДобавитьРазмерВычетаИПНСПроверкой('20220101', Справочники.ВычетыИПН.Стандартный1МЗП, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 14);  

КонецПроцедуры

Процедура ДобавитьРазмерВычетаИПНСПроверкой(Период, ВидВычетаИПН, ВидПределаВычета, Размер) 
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Отбор.ВидВычетаИПН.Установить(ВидВычетаИПН, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.ВидВычетаИПН = ВидВычетаИПН;
		// Ресурсы
		Движение.ВидПределаВычета = ВидПределаВычета;
		Движение.Размер = Размер;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли