#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка с места работы о доходах за последние двенадцать календарных месяцев перед наступлением социального риска'");
	НоваяФорма.ДатаНачалоДействия = '20000101';
	НоваяФорма.ДатаКонецДействия  = '20130531';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка с места работы о доходах за последние 12 месяцев (с изм. постановления Правительства РК от 30 мая 2013 года № 562)'"); 
	НоваяФорма.ДатаНачалоДействия = '20130601';
	НоваяФорма.ДатаКонецДействия  = '20140331';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв2"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка с места работы о доходах за последние 12 месяцев (с изм. постановления Правительства РК от 02 апреля 2014 года № 308)'");
	НоваяФорма.ДатаНачалоДействия = '20140401';
	НоваяФорма.ДатаКонецДействия  = '20150630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв2"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка с места работы о доходах за последние 12 месяцев (утверждена Приказом Министра здравоохранения и социального развития Республики Казахстан от 17 апреля 2015 года № 236)'");
	НоваяФорма.ДатаНачалоДействия = '20150701';
	НоваяФорма.ДатаКонецДействия  = '20160229';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка с места работы о доходах за последние 12 месяцев.'");
	НоваяФорма.ДатаНачалоДействия = '20160301';
	НоваяФорма.ДатаКонецДействия  = '00010101';
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
