
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//СписокДокументов.ЗагрузитьЗначения(Параметры.МасивДокументов);
	Для Каждого Документ Из Параметры.МасивДокументов Цикл		
		СтрокаСписокДокументов = СписокДокументов.Добавить();
		СтрокаСписокДокументов.Дата = Документ.Дата;
		СтрокаСписокДокументов.Ссылка = Документ.Ссылка; 
		СтрокаСписокДокументов.Номер = Документ.Номер; 
		СтрокаСписокДокументов.ВидДокумента = ТипЗнч(Документ.Ссылка) 
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Документ = ТекущиеДанные.Ссылка;
		
	Если ЗначениеЗаполнено(Документ) Тогда 
		ПоказатьЗначение(, Документ);
	КонецЕсли;
	

КонецПроцедуры

