#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДопХарактеристик();
КонецПроцедуры

 
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПоказатьДопХарактеристики(Команда)  
	Элементы.ФормаПоказатьДопХарактеристики.Пометка = не Элементы.ФормаПоказатьДопХарактеристики.Пометка;
	УстановитьВидимостьДопХарактеристик();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимостьДопХарактеристик()
	
	Пометка = Элементы.ФормаПоказатьДопХарактеристики.Пометка;
	Элементы.ДополнительныеХарактеристики.Видимость = Пометка;
	Элементы.ДопХарНачисления.Видимость = Пометка;
	Элементы.ДопХарПлатежи.Видимость = Пометка;
	
КонецПроцедуры
#КонецОбласти

