
////////////////////////////////////////////////////////////////////////////////
// Описание формы
// Параметры фомры:
//  ТаблицаКорреспонденций - ДанныеФормыКоллекция (ТаблицаЗначений)
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТаблицаКорреспонденций") Тогда
		ТаблицаКорреспонденций.Загрузить(Параметры.ТаблицаКорреспонденций.Выгрузить());
		
		Для Каждого СтрокаКорресп ИЗ ТаблицаКорреспонденций Цикл
			СтрокаКорресп.Пометка = Истина;
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Корреспонденция.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Корреспонденция.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьКорреспонденцииНаСервере();
	
	Если ЕстьДобавленныеЗаписи Тогда
		Оповестить("ОбновлениеКорреспонденцииСчетов");
	КонецЕсли;	
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьКорреспонденцииНаСервере()

	Набор = РегистрыСведений.КорректныеКорреспонденцииСчетов.СоздатьНаборЗаписей();

	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Если Корреспонденция.Пометка Тогда

			Набор.Отбор.СчетДт.Установить(Корреспонденция.СчетДт);
			Набор.Отбор.СчетКт.Установить(Корреспонденция.СчетКт);

			Запись = Набор.Добавить();

			Запись.СчетДт      = Корреспонденция.СчетДт;
			Запись.СчетКт      = Корреспонденция.СчетКт;
			Запись.Комментарий = Корреспонденция.Комментарий;

			Набор.Записать();
			Набор.Очистить();

			ЕстьДобавленныеЗаписи = Истина;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
 
