
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Представление = АдресныйКлассификатор.ПолучитьПолноеНазвание(Запись.Код);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьКодыУровней();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	КодПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СокращениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Ожидание = 0;
	
	ДанныеВыбора = КонтактнаяИнформацияКлиентСерверПовтИсп.ПолучитьАдресныеСокращенияПоУровню(Запись.ТипАдресногоЭлемента);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура КодПриИзмененииСервер()
	
	Представление = АдресныйКлассификатор.ПолучитьПолноеНазвание(Запись.Код);

КонецПроцедуры

Процедура ЗаполнитьКодыУровней()
	
	НовыйКодОбластиВКоде           = Цел(Запись.Код / АдресныйКлассификаторКлиентСервер.МаскаОбласти());
	НовыйКодРайонаВКоде            = Цел(Запись.Код / АдресныйКлассификаторКлиентСервер.МаскаРайона()) % 100;	
	НовыйКодНаселенногоПунктаВКоде = Цел(Запись.Код / АдресныйКлассификаторКлиентСервер.МаскаГорода()) % 100000;
	
	Если Запись.КодОбластиВКоде <> НовыйКодОбластиВКоде Тогда
		Запись.КодОбластиВКоде = НовыйКодОбластиВКоде;
	КонецЕсли;
		
	Если Запись.КодРайонаВКоде <> НовыйКодРайонаВКоде Тогда
		Запись.КодРайонаВКоде = НовыйКодРайонаВКоде;
	КонецЕсли;
			
	Если Запись.КодНаселенногоПунктаВКоде <> НовыйКодНаселенногоПунктаВКоде Тогда
		Запись.КодНаселенногоПунктаВКоде = НовыйКодНаселенногоПунктаВКоде;
	КонецЕсли;
		
КонецПроцедуры
