/////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ШТРИХКОДОВ В СПРАВОЧНИКАХ И ДОКУМЕНТАХ

// Сформировать новый штрихкод.
//
Функция ПолучитьМаксимальныйШтрихкод() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(ОсновныеСредства.Штрихкод, 2, 11)) КАК Код
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат ?(Выборка.Код = "", 0, Мин(Число(Выборка.Код), 99999999999));
	                                        
КонецФункции	

// Сформировать новый штрихкод.
//
Функция СформироватьШтрихкод(ТекущийКод = Неопределено) Экспорт
	
	Если ТекущийКод = Неопределено Тогда
		ТекущийКод = ПолучитьМаксимальныйШтрихкод() + 1;
	КонецЕсли;	
	                                        
	Штрихкод = "2" + Формат(ТекущийКод, "ЧЦ=11; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN13(ШтрихКод);

	Возврат Штрихкод;
	
КонецФункции	

// Функция возвращает контрольный символ штрихкода EAN13.
//
// Параметры:
//  Штрихкод - Строка
//           - Неполный штрихкод (12 символов), для которого вычисляется
//             контрольный 13-й символ.
//
// Возвращаемое значение:
//  Строка - Контрольный символ EAN13.
//
Функция КонтрольныйСимволEAN13(Штрихкод) Экспорт
	
	Результат   = "";
	Сумма       = 0;
	Коэффициент = 1;
	
	Для Индекс = 1 По 12 Цикл
		ВремКодСимвола = КодСимвола(Штрихкод, Индекс);
		Сумма       = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма     = (10 - Сумма % 10) % 10;
	Результат = Символ(Сумма + 48);
	
	Возврат Результат;
	
КонецФункции 

Процедура СформироватьШтрихкодаМассиваОС(МассивОС, ФормироватьТолькоНовыеШтрихкода = Истина) Экспорт 
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОС
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОС)
	|	" + ?(ФормироватьТолькоНовыеШтрихкода, " И ОсновныеСредства.Штрихкод = &ПустаяСтрока", "");
	
	Запрос.УстановитьПараметр("МассивОС"	, МассивОС);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	РезультатЗапроса 	= Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'В табличной части нет ни одного основного средства с пустым штрихкодом.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	ВыборкаЗапроса 		= РезультатЗапроса.Выбрать();
	ТекущийКод 			= ПолучитьМаксимальныйШтрихкод() + 1;
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОС 							= ВыборкаЗапроса.ОС.ПолучитьОбъект();
		Штрихкод 					= СформироватьШтрихкод(ТекущийКод);
		ОС.Штрихкод 				= Штрихкод;
		ОС.ОбменДанными.Загрузка 	= Истина;
		Попытка 
			ОС.Записать();
		Исключение	
			ТекстСообщения = НСтр("ru='При записи основного средства ""%1""  произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОС, ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		ТекущийКод = ТекущийКод + 1;
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru='Штрихкоды сформированы'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры	

Функция ПолучитьДанныеДляПечатиОС(ИмяДокумента, МассивДокументов) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос 			= Новый Запрос;
	ТекстЗапроса 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОС.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОС КАК ОС
	|ГДЕ
	|	ОС.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументОС.Организация КАК Организация
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ДокументОС
	|ГДЕ
	|	ДокументОС.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПоступлениеТоваровУслуг", ИмяДокумента);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ДанныеДляЗаполнения = МассивРезультатов[1].Выгрузить();
	
	// Подготовка данных для заполенения табличной части обработки печати
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ОС"			, МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("Организация"	, ?(ДанныеДляЗаполнения.Количество() = 1, ДанныеДляЗаполнения[0].Организация , Неопределено));
	СтруктураРезультат.Вставить("ДатаСведений"	, ?(МассивДокументов.Количество() = 1	, МассивДокументов[0].Дата, Дата(1,1,1)));
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураРезультат;
	
КонецФункции	
// 
/////////////////////////////////////////////////////////////////////
