#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОДоляхЕП();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОДоляхЕП() Экспорт
	                                                   
	НаборЗаписей = РегистрыСведений.СведенияОДоляхЕП.СоздатьНаборЗаписей();
	
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20230101', 50, 10, 9, 16, 15, 0);
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20240101', 46.5, 9.3, 8.4, 14.9, 14, 7);
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕП(НаборЗаписей, Период, ДоляОПВ, ДоляВОСМС, ДоляИПН, ДоляСО, ДоляООСМС, ДоляОПВР)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ДоляОПВ = ДоляОПВ;
	НоваяЗапись.ДоляВОСМС = ДоляВОСМС;
	НоваяЗапись.ДоляИПН = ДоляИПН;
	НоваяЗапись.ДоляСО = ДоляСО;
	НоваяЗапись.ДоляООСМС = ДоляООСМС;
	НоваяЗапись.ДоляОПВР = ДоляОПВР;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли