
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	//БМ_ИСМПТ ТРЕБУЕТСЯ_РАССМОТРЕНИЕ Шаблон этикеток - выбор этикетки для упаковки	
	//ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИСМП.ЭтикеткаДляШтрихкодовУпаковок);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИСМПТК.ЭтикеткаКодМаркировкиИСМП);
	
КонецПроцедуры

#КонецОбласти
