#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по особенностям учета номенклатуры.
//
// Параметры:
//  ОсобенностьУчета - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры	 - особенность учета номенклатуры.
// 
// Возвращаемое значение:
//  Строка - подсказка по особенности учета номенклатуры.
//
Функция ПодсказкаПоОсобенностиУчетаНоменклатуры(ОсобенностьУчета) Экспорт
	
	Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета Тогда
		Возврат "";
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция Тогда
		Возврат НСтр("ru = 'Формируются декларации по алкогольной продукции и осуществляется обмен с ЕГАИС информацией по обороту.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы Тогда
		Возврат НСтр("ru = 'Статистическая отчетность по содержанию драгоценных материалов.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ Тогда
		Возврат НСтр("ru = 'Продукция маркируется специальными контрольными идентификационными знаками (КиЗ) и осуществляется обмен с ГИСМ (информационной системой маркировки товаров) информацией по обороту.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ Тогда
		Возврат НСтр("ru = 'Контрольные идентификационные знаки (КИЗ), которыми маркируется продукция, учитываемая в ГИСМ (информационной системе маркировки товаров).'");
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

//ИнтеграцияИСМПТК
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	//ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПТК") Тогда
		
		Если Константы.ВестиУчетМаркируемогоАлкоголяИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемойОбувиИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемогоТабакаИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемойМолочкиИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемогоТекстиляИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемыхЛекарствИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//Конец ИнтеграцияИСМПТК

#КонецЕсли

