
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытияФормы = Новый Структура();
	Отбор = Новый Структура();
	
	Если ПараметрыВыполненияКоманды.Источник.Заголовок = "Маркировка и прослеживаемость товаров (ИС МПТ)" Тогда //Открытие из РМ маркировки
		Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Организация) Тогда
			Отбор.Вставить("Организация", ПараметрыВыполненияКоманды.Источник.Организация);
		КонецЕсли;
	КонецЕсли;
	ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
	
	Если ЕстьПравоДоступаКНастройкам() Тогда
		ОткрытьФорму("Обработка.РабочиеМестаИСМПТК.Форма.РабочееМестоПроверкаАгрегации", ПараметрыОткрытияФормы);
	Иначе
		ТекстСообщения = НСтр("ru='Недостаточно прав для открытия формы обработки! Обратитесь к администратору системы.'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьПравоДоступаКНастройкам()
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ОбменИСМПТК);
	
КонецФункции
