Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102009Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Форма имеет возможность выгрузки в ИС СОНО 3.119.56, версия ФНО: 210.00.v16.r59 от 30.10.2009 г.";
	НоваяФорма.ДатаНачалоДействия = '20090101';
	НоваяФорма.ДатаКонецДействия  = '20091231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102010Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v21.r114 от 22.10.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20100101';
	НоваяФорма.ДатаКонецДействия  = '20101231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102011Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v22.r120 от 18.04.2011 г.";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20111231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102012Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v23.r131 от 29.12.2011 г.";
	НоваяФорма.ДатаНачалоДействия = '20120101';
	НоваяФорма.ДатаКонецДействия  = '20121231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102013Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v24.r136 от 27.12.2012 г.";
	НоваяФорма.ДатаНачалоДействия = '20130101';
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102014Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v25.r141 от 31.12.2013 г.";
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v26.r142 от 19.01.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20150101';
	НоваяФорма.ДатаКонецДействия  = '20150630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102015Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v27.r144 от 04.07.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20150701';
	НоваяФорма.ДатаКонецДействия  = '20151231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2102016Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу по иностранцам и лицам без гражданства. Версия шаблона ФНО для ИС СОНО: 210.00.v28.r145 от 24.12.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20160101';
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции          
