#Область ПрограммныйИнтерфейс

Функция АдресТестовогоСтенда() Экспорт
	
	Возврат "test-etd.1capp.kz";
	
КонецФункции

Функция АдресПродуктивногоСтенда() Экспорт
	
	Возврат "etd.1capp.kz";
	
КонецФункции

Функция ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат ЭТДВызовСервера.ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса);
	#Иначе
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		
		Соединение = Новый HTTPСоединение(Адрес,443,,,,1,ЗащищенноеСоединение);
		
		Запрос = Новый HTTPЗапрос(СтрокаЗапроса);
		Запрос.Заголовки.Вставить("Content-type", "application/json");
		
		Попытка
			Ответ = Соединение.Получить(Запрос);
		Исключение
			Возврат Ложь;
		КонецПопытки;

		Если Ответ.КодСостояния = 200 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	#КонецЕсли
	
КонецФункции

Процедура ЗаполнитьУсловияТруда(УсловияТруда, УсловиеЗначение) Экспорт
	
	УсловияТруда.Очистить();
	
	СтрокаУсловийТруда = УсловияТруда.Добавить();
	СтрокаУсловийТруда.УсловиеТруда = УсловиеЗначение;
	
КонецПроцедуры

#Область Криптобиблиотека

Функция ПолучитьТекущуюВерсиюМакета() Экспорт
	
	// Версия макета криптобиблиотеки
	Возврат "5.31";
	
КонецФункции

Функция КонтейнерМетодов() Экспорт
	
	Контейнер = Неопределено;
	
	#Если ТонкийКлиент ИЛИ ВебКлиент ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Контейнер = ПолучитьФорму("Обработка.ОбменЭТД.Форма.КлиентУправляемая");
		
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		
		ВызватьИсключение(НСтр("ru = 'Криптокомпонента не предназначена для использования в обычном приложении'"));
		
	#ИначеЕсли Сервер ИЛИ ВнешнееСоединение Тогда
		
		Контейнер = Обработки.ОбменЭТД.Создать();
		
	#КонецЕсли
	
	Возврат Контейнер;
	
КонецФункции

Функция НовыйЭкземплярКриптопровайдера(УникальныйИдентификаторФормыКлиента = Неопределено, РежимТишины = Ложь, ТолькоПодключение = Ложь) Экспорт
	
	Возврат ЭТДКлиентСерверПовтИсп.НовыйЭкземплярКриптопровайдера(УникальныйИдентификаторФормыКлиента, РежимТишины, ТолькоПодключение);
	
КонецФункции

Функция СоздатьЭЦП_XML_Криптопровайдер(Знач ДанныеXML, ИдентификаторКлиента = "", ПараметрыКлюча = Неопределено) Экспорт
	
	СтрокаДляПодписи = ЭТД_ЗаписатьЗначениеJSON(ДанныеXML);
	
	Попытка
		
		Криптопровайдер = НовыйЭкземплярКриптопровайдера();
		
		Если Криптопровайдер = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось подключить криптокомпоненту.'");
			Возврат ТекстСообщения;
		КонецЕсли;
		
		ИмяСервиса = "1CService";
		ПараметрыПодписи = ЭлектронноеВзаимодействиеССервисамиВызовСервера.ПолучитьПараметрыКомпонентыЭТД(ИдентификаторКлиента, ДанныеXML, ПараметрыКлюча);
		
		ОтветОтКриптопровайдера = Криптопровайдер.GetXMLSign(ИдентификаторКлиента, ИмяСервиса, ПараметрыПодписи, СтрокаДляПодписи, "", "");
		
	Исключение
		
		Если ЗначениеЗаполнено(ПараметрыКлюча) Тогда
			УдалитьВременныйФайлКлюча(ПараметрыКлюча);
		КонецЕсли;
		
		Ошибка = ОшибкаКриптопровайдера(Криптопровайдер, ИнформацияОбОшибке());
		
		ЭТДВызовСервера.СоздатьЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения'"), "Ошибка", , , Ошибка.ПодробноеПредставление);
		
		ТекстИсключения = НСтр("ru = 'Не удалось сформировать ЭЦП в формате XML.
									  |[ОписаниеОшибки]
									  |[КраткоеПредставление]'");
		Если ТипЗнч(Ошибка.ОписаниеОшибки) = Тип("Строка")
			И ЗначениеЗаполнено(Ошибка.ОписаниеОшибки) Тогда
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "[ОписаниеОшибки]", Ошибка.ОписаниеОшибки);
		Иначе
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "[ОписаниеОшибки]", "");
		КонецЕсли;
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "[КраткоеПредставление]", Ошибка.КраткоеПредставление);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПараметрыКлюча) Тогда
		УдалитьВременныйФайлКлюча(ПараметрыКлюча);
	КонецЕсли;
	
	Если ОтветОтКриптопровайдера = "" Тогда
		ТекстСообщения = НСтр("ru = 'Возникла проблема при использовании NCALayer. Возможно, программа не запущена, или не установлен модуль ""1С-Рейтинг ЭДО""'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Попытка
		
		ПодписанныеДанныеСтруктура = ЭТД_ПрочитатьЗначениеJSON(ОтветОтКриптопровайдера);
		
		Если ПодписанныеДанныеСтруктура.Свойство("responseobject") И ПодписанныеДанныеСтруктура.code = "200" Тогда
			ПодписанныеДанные =  ПодписанныеДанныеСтруктура.responseObject;
		ИначеЕсли ПодписанныеДанныеСтруктура.code = "500"  Тогда
			ПодписанныеДанные = Неопределено;
			
			Если ПодписанныеДанныеСтруктура.Свойство("message") Тогда
				ТекстСообщения = "";
				Если ПодписанныеДанныеСтруктура.message = "action.canceled" Тогда
					ТекстСообщения = НСтр("ru = 'Выбор сертификата отменен пользователем.'");
				ИначеЕсли ПодписанныеДанныеСтруктура.message = "" Тогда
					ТекстСообщения = Криптопровайдер.ТекстОшибки;
				Иначе
					ТекстСообщения = СтрЗаменить(ПодписанныеДанныеСтруктура.message, "action.canceled.", "");
					ТекстСообщения = СокрЛ(ТекстСообщения);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекстСообщения) Тогда
					ПодписанныеДанные = ТекстСообщения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат ПодписанныеДанные;
		
	Исключение
		
		Возврат НСтр("ru = 'Не удалось прочитать ответ:'") + Символы.ПС + СокрЛП(ОтветОтКриптопровайдера);
		
	КонецПопытки;

КонецФункции

Функция СоздатьЭЦП_XML_КриптопровайдерДляСписка(Знач МассивXML, ИдентификаторКлиента = "", ПараметрыКлюча = Неопределено) Экспорт
	
	СтрокаДляПодписи = ЭТД_ЗаписатьЗначениеJSON(МассивXML);
	
	Попытка
		
		Криптопровайдер = НовыйЭкземплярКриптопровайдера();
		
		Если Криптопровайдер = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось подключить криптокомпоненту.'");
			Возврат ТекстСообщения;
		КонецЕсли;
		
		ИмяСервиса = "1CService";
		ПараметрыПодписи = ЭлектронноеВзаимодействиеССервисамиВызовСервера.ПолучитьПараметрыКомпонентыЭТД(ИдентификаторКлиента, МассивXML, ПараметрыКлюча);
		
		ОтветОтКриптопровайдера = Криптопровайдер.GetXMLsSign(ИдентификаторКлиента, ИмяСервиса, ПараметрыПодписи, СтрокаДляПодписи, "", "");
		
	Исключение
		
		Если ЗначениеЗаполнено(ПараметрыКлюча) Тогда
			УдалитьВременныйФайлКлюча(ПараметрыКлюча);
		КонецЕсли;
		
		Ошибка = ОшибкаКриптопровайдера(Криптопровайдер, ИнформацияОбОшибке());
		
		ЭТДВызовСервера.СоздатьЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка выполнения'"), "Ошибка", , , Ошибка.ПодробноеПредставление);
		
		ТекстИсключения = НСтр("ru = 'Не удалось сформировать ЭЦП в формате XML.
									  |[ОписаниеОшибки]
									  |[КраткоеПредставление]'");
		Если ТипЗнч(Ошибка.ОписаниеОшибки) = Тип("Строка")
			И ЗначениеЗаполнено(Ошибка.ОписаниеОшибки) Тогда
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "[ОписаниеОшибки]", Ошибка.ОписаниеОшибки);
		Иначе
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "[ОписаниеОшибки]", "");
		КонецЕсли;
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "[КраткоеПредставление]", Ошибка.КраткоеПредставление);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПараметрыКлюча) Тогда
		УдалитьВременныйФайлКлюча(ПараметрыКлюча);
	КонецЕсли;
	
	Если ОтветОтКриптопровайдера = "" Тогда
		ТекстСообщения = НСтр("ru = 'Возникла проблема при использовании NCALayer. Возможно, программа не запущена, или не установлен модуль ""1С-Рейтинг ЭДО""'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Попытка
		
		ПодписанныеДанныеСтруктура = ЭТД_ПрочитатьЗначениеJSON(ОтветОтКриптопровайдера);
		
		Если ПодписанныеДанныеСтруктура.Свойство("responseobject") И ПодписанныеДанныеСтруктура.code = "200" Тогда
			ПодписанныеДанные =  ПодписанныеДанныеСтруктура.responseObject;
		ИначеЕсли ПодписанныеДанныеСтруктура.code = "500"  Тогда
			ПодписанныеДанные = Неопределено;
			
			Если ПодписанныеДанныеСтруктура.Свойство("message") Тогда
				ТекстСообщения = "";
				Если ПодписанныеДанныеСтруктура.message = "action.canceled" Тогда
					ТекстСообщения = НСтр("ru = 'Выбор сертификата отменен пользователем.'");
				ИначеЕсли ПодписанныеДанныеСтруктура.message = "" Тогда
					ТекстСообщения = Криптопровайдер.ТекстОшибки;
				Иначе
					ТекстСообщения = СтрЗаменить(ПодписанныеДанныеСтруктура.message, "action.canceled.", "");
					ТекстСообщения = СокрЛ(ТекстСообщения);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекстСообщения) Тогда
					ПодписанныеДанные = ТекстСообщения;
				КонецЕсли;;
			КонецЕсли;
		КонецЕсли;
		
		Возврат ПодписанныеДанные;
		
	Исключение
		
		Возврат НСтр("ru = 'Не удалось прочитать ответ:'") + Символы.ПС + СокрЛП(ОтветОтКриптопровайдера);
		
	КонецПопытки;
	
КонецФункции

Функция ОшибкаКриптопровайдера(Криптопровайдер, ИнформацияОбОшибке) Экспорт
	
	Ошибка = Новый Структура;
	
	Если Криптопровайдер = Неопределено Тогда
		Ошибка.Вставить("Версия", "");
		Ошибка.Вставить("КодОшибки", "");
		Ошибка.Вставить("ОписаниеОшибки", "");		
	Иначе
		Ошибка.Вставить("Версия", Криптопровайдер.Версия);
		Ошибка.Вставить("КодОшибки", Криптопровайдер.КодОшибки);
		Ошибка.Вставить("ОписаниеОшибки", Криптопровайдер.ТекстОшибки);
	КонецЕсли;
	
	Ошибка.Вставить("ИнформацияОбОшибке", ИнформацияОбОшибке);
	
	ТипОшибки = ТипОшибкиКриптопровайдера(Ошибка);
	Ошибка.Вставить("ТипОшибки", ТипОшибки);
	
	ПредставленияОшибки = ПредставленияОшибкиКриптопровайдера(Ошибка);
	Ошибка.Вставить("КраткоеПредставление", ПредставленияОшибки.КраткоеПредставление);
	Ошибка.Вставить("ПодробноеПредставление", ПредставленияОшибки.ПодробноеПредставление);
	
	Возврат Ошибка;
	
КонецФункции

Функция ПодготовитьПараметрыКлючаДляПодписи(ДанныеКлючаЭЦП) Экспорт
	
	ПараметрыКлюча = Неопределено;
	Если ЭТДВызовСервера.ИспользоватьВнешнююКриптографиюДляКомпоненты() Тогда
		Если ЭТДВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			ПараметрыКлюча = СохранитьКлючВФайл(ДанныеКлючаЭЦП);
		Иначе
			ПараметрыКлюча = ЭТДВызовСервера.СохранитьКлючВФайл(ДанныеКлючаЭЦП);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыКлюча;
	
КонецФункции

Функция СохранитьКлючВФайл(ДанныеКлючаЭЦП) Экспорт
	
	ПараметрыКлюча = Неопределено;
	
	#Если Не ВебКлиент Тогда
		ДвоичныеДанныеКлюча = Base64Значение(ДанныеКлючаЭЦП.КлючBase64);
		ИмяФайлаКлюча = ПолучитьИмяВременногоФайла("p12");
		ДвоичныеДанныеКлюча.Записать(ИмяФайлаКлюча);
		ПараметрыКлюча = Новый Структура;
		ПараметрыКлюча.Вставить("АдресКлюча" , ИмяФайлаКлюча);
		ПараметрыКлюча.Вставить("ПарольКлюча", ДанныеКлючаЭЦП.Пароль);
	#КонецЕсли
	
	Возврат ПараметрыКлюча;
	
КонецФункции
 
Процедура УдалитьВременныйФайлКлюча(ДанныеКлючаЭЦП) Экспорт
	
	Если ЭТДВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
		УдалитьФайлКлюча(ДанныеКлючаЭЦП);
	Иначе
		ЭТДВызовСервера.УдалитьФайлКлюча(ДанныеКлючаЭЦП);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьФайлКлюча(ДанныеКлючаЭЦП) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеКлючаЭЦП) И ДанныеКлючаЭЦП.Свойство("АдресКлюча") Тогда
		УдалитьВременныеФайлы(ДанныеКлючаЭЦП.АдресКлюча);
	КонецЕсли;
	
КонецПроцедуры 

Процедура УдалитьВременныеФайлы(ПутьКФайлам) Экспорт
	
	Попытка
		УдалитьФайлы(ПутьКФайлам);
	Исключение
		ЗаписьЖурналаРегистрацииОшибкаУдаленияФайла(ПутьКФайлам, ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭТД_ЗаписатьЗначениеJSON(Значение)
	
	Результат = Неопределено;
	#Если ВебКлиент Тогда
		Результат = ЭТДВызовСервера.ЭТД_ЗаписатьЗначениеJSON(Значение);
	#Иначе
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Значение);
		Результат = Запись.Закрыть();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

Функция ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты = "")
	
	Результат = Неопределено;
	#Если ВебКлиент Тогда
		Результат = ЭТДВызовСервера.ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты);
	#Иначе
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Значение);
		Результат = ПрочитатьJSON(Чтение, Ложь, СвойстваДаты);
		Чтение.Закрыть();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

#Область Криптобиблиотека

Функция ТипОшибкиКриптопровайдера(Ошибка)
	
	ТипОшибки = Ошибка_НеизвестнаяОшибка();
	
	Если Найти(Ошибка.ОписаниеОшибки, "0D0680A8") Тогда
		ТипОшибки = Ошибка_НеверныйФайл();		
	ИначеЕсли Найти(Ошибка.ОписаниеОшибки, "23076071") Тогда
		ТипОшибки = Ошибка_НеверныйПароль();	
	Иначе
		ТипОшибки = Ошибка_НеизвестнаяОшибка();	
	КонецЕсли;
	
	Возврат ТипОшибки;
	
КонецФункции

Функция ПредставленияОшибкиКриптопровайдера(Ошибка)
	
	ПредставленияОшибки = Новый Структура;
	
	КраткоеПредставление = КраткоеПредставлениеОшибкиКриптопровайдера(Ошибка);
	ПредставленияОшибки.Вставить("КраткоеПредставление", КраткоеПредставление);
	
	ПодробноеПредставление = ПодробноеПредставлениеОшибкиКриптопровайдера(Ошибка);
	ПредставленияОшибки.Вставить("ПодробноеПредставление", ПодробноеПредставление);
	
	Возврат ПредставленияОшибки;
	
КонецФункции

Функция КраткоеПредставлениеОшибкиКриптопровайдера(Ошибка)
	
	КраткоеПредставление = "";
	
	Если Ошибка.ТипОшибки = Ошибка_НеверныйФайл() Тогда
		КраткоеПредставление = НСтр("ru = 'Возможно выбранный файл не является файлом сертификата ""*.p12"".'");		
	ИначеЕсли Ошибка.ТипОшибки = Ошибка_НеверныйПароль() Тогда
		КраткоеПредставление = НСтр("ru = 'Возможно был введен некорректный пароль для файла сертификата.'");				
	Иначе	
		КраткоеПредставление = КраткоеПредставлениеОшибки(Ошибка.ИнформацияОбОшибке);					
	КонецЕсли;
	
	Возврат КраткоеПредставление;
	
КонецФункции

Функция ПодробноеПредставлениеОшибкиКриптопровайдера(Ошибка)
	
	ПодробноеПредставление = НСтр(
	"ru = '[КраткоеПредставление]
	|[ИнформацияИзКриптопровайдера]
	|[ПодробноеПредставлениеОшибки]'");
	
	КраткоеПредставление = КраткоеПредставлениеОшибкиКриптопровайдера(Ошибка);	
	ПодробноеПредставление = СтрЗаменить(ПодробноеПредставление, "[КраткоеПредставление]", КраткоеПредставление);
	
	Если ПустаяСтрока(Ошибка.Версия) И ПустаяСтрока(Ошибка.КодОшибки) И ПустаяСтрока(Ошибка.ОписаниеОшибки) Тогда
		ИнформацияИзКриптопровайдера = "";
	Иначе
		ИнформацияИзКриптопровайдера = НСтр("ru = 'Версия криптографии: %1, Код ошибки: %2, Описание ошибки: %3'");
		ИнформацияИзКриптопровайдера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияИзКриптопровайдера, Ошибка.Версия, Ошибка.КодОшибки, Ошибка.ОписаниеОшибки);
	КонецЕсли;	
	ПодробноеПредставление = СтрЗаменить(ПодробноеПредставление, "[ИнформацияИзКриптопровайдера]", ИнформацияИзКриптопровайдера);
	
	ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка.ИнформацияОбОшибке);
	ПодробноеПредставление = СтрЗаменить(ПодробноеПредставление, "[ПодробноеПредставлениеОшибки]", ПодробноеПредставлениеОшибки);
	
	Возврат ПодробноеПредставление;
	
КонецФункции

Функция Ошибка_НеверныйПароль()
	Возврат "НеверныйПароль";	
КонецФункции

Функция Ошибка_НеверныйФайл()
	Возврат "НеверныйФайл";	
КонецФункции

Функция Ошибка_НеизвестнаяОшибка()
	Возврат "НеизвестнаяОшибка";	
КонецФункции

Процедура ЗаписьЖурналаРегистрацииОшибкаУдаленияФайла(ИмяФайла, ИнформацияОбОшибке)
	
	Комментарий = НСтр(
		"ru = 'Не удалось удалить файл %ИмяФайла% по причине:
		|
		|%ПодробноеПредставлениеОшибки%'");
		
	Комментарий = СтрЗаменить(Комментарий, "%ИмяФайла%", ИмяФайла);
	Комментарий = СтрЗаменить(Комментарий, "%ПодробноеПредставлениеОшибки%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ЭТДВызовСервера.СоздатьЗаписьЖурналаРегистрации("ЭТДКлиентСервер.УдалитьВременныеФайлы", "Ошибка", , , Комментарий);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
