
// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
Процедура ПоказатьВводШтрихкода(Оповещение, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ШтрихкодированиеИСМПТККлиент.ПоказатьВводШтрихкода(Оповещение);
		
	Возврат;
	
КонецПроцедуры

// В процедуре необходимо реализовать очистку коллекции штрихкодов, которые находятся в структуре кэшированные значения.
//
// Параметры:
//  ДанныеШтрихкодов - Соответствие - Данные штрихкодов.
//  КэшированныеЗначения - Структура - Содержит поля кэшируемых значений.
Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	//++ НЕ ГОСИС
	КэшированныеЗначения.Штрихкоды.Очистить();
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

