#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СистемаНалогообложенияПоУмолчанию() Экспорт
	
	Возврат "Патент";
	
КонецФункции

Функция СистемыНалогообложенияДопускающиеТрудНаемныхРаботников() Экспорт
	
	СистемыНалогообложенияДопускающиеТрудНаемныхРаботников = Новый Массив;
	
	СистемыНалогообложенияДопускающиеТрудНаемныхРаботников.Добавить("УпрощеннаяДекларация");
	СистемыНалогообложенияДопускающиеТрудНаемныхРаботников.Добавить("ФиксированныйВычет");
	СистемыНалогообложенияДопускающиеТрудНаемныхРаботников.Добавить("Общеустановленный");
	СистемыНалогообложенияДопускающиеТрудНаемныхРаботников.Добавить("РозничныйНалог");
	
	Возврат СистемыНалогообложенияДопускающиеТрудНаемныхРаботников;
	
КонецФункции

Процедура ПодключитьИнтернетПоддержку(ПараметрыЗадания, АдресХранилища) Экспорт
	
	ДанныеАутентификации = Новый Структура("Логин, Пароль", ПараметрыЗадания.ЛогинИПП, ПараметрыЗадания.ПарольИПП);
	УстановитьПривилегированныйРежим(Истина);
	ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(ДанныеАутентификации);
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = "ПодключениеУспешно";
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатПолученияТикета = ИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки("https://api.orgregister.1c.ru/orgregister/");
		УстановитьПривилегированныйРежим(Ложь);
		Если ЗначениеЗаполнено(РезультатПолученияТикета.КодОшибки) Тогда
			
			Если ВРЕГ(РезультатПолученияТикета.КодОшибки) = ВРЕГ("НеверныйЛогинИлиПароль") Тогда
				Результат = "ОшибкаАвторизации";
			ИначеЕсли ВРЕГ(РезультатПолученияТикета.КодОшибки) = ВРЕГ("ОшибкаПодключения") Тогда
				Результат = "ОшибкаПодключения";
			ИначеЕсли ВРЕГ(РезультатПолученияТикета.КодОшибки) = ВРЕГ("ОшибкаСервиса") Тогда
				Результат = "ОшибкаСервиса";
			Иначе
				Результат = "Неопределено";
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Результат = "Неопределено";
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
	КонецПопытки;
	
	Если Результат <> "ПодключениеУспешно" Тогда
		// Отключаем интернет-поддержку
		УстановитьПривилегированныйРежим(Истина);
		ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(Неопределено);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Интернет-поддержка пользователей'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции


#Область СозданиеОрганизации

Функция ИспользуетсяПолнаяФункциональность() Экспорт
	
	ВариантФункциональности = Обработки.ФункциональностьПрограммы.ВариантФункциональности();
	Возврат (ВариантФункциональности = ФункциональностьПрограммыКлиентСервер.ПолнаяФункциональность());
	
КонецФункции

Функция ИспользуетсяОсновнаяФункциональность() Экспорт
	
	ВариантФункциональности = Обработки.ФункциональностьПрограммы.ВариантФункциональности();
	Возврат (ВариантФункциональности = ФункциональностьПрограммыКлиентСервер.ОсновнаяФункциональность());
	
КонецФункции

Функция УстановитьПодходящийИнтерфейс(ВидОрганизации, СистемаНалогообложения, ИспользуетсяТрудНаемныхРаботников, РазрешенУчетРегулярнойДеятельности = Истина) Экспорт
	
	//НастройкиИнтерфейса = ПодходящиеНастройкиИнтерфейса(СистемаНалогообложения);
	//
	//ВариантИнтерфейса = ?(РазрешенУчетРегулярнойДеятельности,
	//	НастройкиИнтерфейса.ВариантИнтерфейса,
	//	"ИнтерфейсТаксиПростой");
	//ОбщегоНазначенияБП.УстановитьРежимКомандногоИнтерфейса(ВариантИнтерфейса);
	//
	//БезЗакрывающихДокументов = ?(ВидОрганизации = "ИндивидуальныйПредприниматель" И НЕ ИспользуетсяТрудНаемныхРаботников,
	//	НастройкиИнтерфейса.БезЗакрывающихДокументов,
	//	Ложь);
	//
	//Если НастройкиИнтерфейса.ВариантИнтерфейса = "ИнтерфейсТаксиПростой"
	//	И НЕ БезЗакрывающихДокументов Тогда
	//	Константы.ИспользоватьДокументыПоступления.Установить(Истина);
	//	Константы.ИспользоватьДокументыРеализации.Установить(Истина);
	//КонецЕсли;
	//
	//Возврат ВариантИнтерфейса;
	
КонецФункции

Процедура СоздатьОрганизацию(ПараметрыСозданияОрганизации, АдресВременногоХранилища) Экспорт
	
	ВременныйАдресВременногоХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.Организации.СоздатьОрганизацию(ПараметрыСозданияОрганизации, ВременныйАдресВременногоХранилища);
	
	РезультатСозданияОрганизации = ПолучитьИзВременногоХранилища(ВременныйАдресВременногоХранилища);
	
	Если ЗначениеЗаполнено(РезультатСозданияОрганизации) Тогда
		
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Владелец = &Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|ГДЕ
			|	ПодразделенияОрганизаций.Владелец = &Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Склады.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Склады КАК Склады
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УстановкаСоответствияСчетовБУиНУ.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.УстановкаСоответствияСчетовБУиНУ КАК УстановкаСоответствияСчетовБУиНУ
			|ГДЕ
			|	УстановкаСоответствияСчетовБУиНУ.Дата = &Дата
			|	И УстановкаСоответствияСчетовБУиНУ.Проведен";
		
		Запрос.УстановитьПараметр("Владелец", РезультатСозданияОрганизации);
		Запрос.УстановитьПараметр("Дата", '19800101');
		
		Результаты = Запрос.ВыполнитьПакет();

		// Заполнение справочника "Кассы"
		Если Результаты[0].Пустой() Тогда
			Касса = Справочники.Кассы.СоздатьЭлемент();
			Касса.Владелец 				= РезультатСозданияОрганизации.Ссылка;
			Касса.Наименование          = НСтр("ru = 'Основная касса'");
			Касса.ВалютаДенежныхСредств = ВалютаРегламентированногоУчета;
			Попытка
				Касса.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Операция не выполнена. Создание основной кассы организации'");
				ЗаписьЖурналаРегистрации(ТекстСообщения,
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.Кассы,
					,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Метаданные.ОсновнойЯзык.КодЯзыка);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru = 'См. Журнал регистрации'");
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		
		// Заполнение справочника "ПодразделенияОрганизаций"
		Если Результаты[1].Пустой() Тогда
			Подразделение               = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
			Подразделение.Владелец      = РезультатСозданияОрганизации.Ссылка;
			Подразделение.Наименование  = НСтр("ru = 'Основное подразделение'");
			Попытка
				Подразделение.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Операция не выполнена. Создание основного подразделения организации'");
				ЗаписьЖурналаРегистрации(ТекстСообщения,
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ПодразделенияОрганизаций,
					,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Метаданные.ОсновнойЯзык.КодЯзыка);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru = 'См. Журнал регистрации'");
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;

		// Заполнение справочника "Склады"
		Если Результаты[2].Пустой() Тогда
			Склад = Справочники.Склады.СоздатьЭлемент();
			Склад.Наименование  = НСтр("ru = 'Основной склад'");
			Склад.Комментарий   = НСтр("ru = 'Основной склад организации'");
			Склад.Записать();
			Попытка
				Склад.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Операция не выполнена. Создание основного склада'");
				ЗаписьЖурналаРегистрации(ТекстСообщения,
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.Склады,
					,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Метаданные.ОсновнойЯзык.КодЯзыка);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru = 'См. Журнал регистрации'");
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;

		Если Результаты[3].Пустой() Тогда
			ЗаполнитьСоответствиеСчетовБУиНУ('19800101', РезультатСозданияОрганизации);
		КонецЕсли;
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда 
		ПоместитьВоВременноеХранилище(РезультатСозданияОрганизации, АдресВременногоХранилища);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеСчетовБУиНУ(ТекущаяДата, ОрганизацияПервоначальногоЗаполнения) Экспорт
	
	ДокументУстановкаСоответствияСчетовБУиНУ = Документы.УстановкаСоответствияСчетовБУиНУ.СоздатьДокумент();
	ДокументУстановкаСоответствияСчетовБУиНУ.Дата 		 = ТекущаяДата;
	ДокументУстановкаСоответствияСчетовБУиНУ.Организация = ОрганизацияПервоначальногоЗаполнения;
	ДокументУстановкаСоответствияСчетовБУиНУ.УстановитьНовыйНомер();
	Документы.УстановкаСоответствияСчетовБУиНУ.ЗаполнитьСоответствиеСчетовБУиНУПоУмолчанию(ДокументУстановкаСоответствияСчетовБУиНУ);
	Попытка
		ДокументУстановкаСоответствияСчетовБУиНУ.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена. Создание документа ""Установка соответствия счетов БУ и НУ""'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.УстановкаСоответствияСчетовБУиНУ,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru = 'См. Журнал регистрации'");
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	Попытка
		ДокументУстановкаСоответствияСчетовБУиНУ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена. Проведение документа ""Установка соответствия счетов БУ и НУ""'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.УстановкаСоответствияСчетовБУиНУ,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru = 'См. Журнал регистрации'");
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры // ЗаполнитьСоответствиеСчетовБУиНУ()

#КонецОбласти


#Область НачальноеЗаполнение

Процедура ВыполнитьНачальноеЗаполнение(Параметры, АдресХранилища) Экспорт
	
	Для Каждого ЭлементЗаполнения Из Параметры.ВыбранныеНастройкиЗаполнения Цикл
		
		ОбъектЗаполнения = ЭлементЗаполнения.Значение;
		
		Если ОбъектЗаполнения = "ДополнительнаяКолонкаПечатныхФормДокументов" Тогда 
			
			УстановитьДополнительнаяКолонкаПечатныхФормДокументов();
		
		ИначеЕсли ОбъектЗаполнения = "ПредставлениеНомераДокументов" Тогда 
			
			УстановитьПредставлениеНомераДокументов();
			
		ИначеЕсли ОбъектЗаполнения = "СрокОплатыПокупателей" Тогда 
			
			УстановитьСрокОплатыПокупателей();
			
		ИначеЕсли ОбъектЗаполнения = "СрокОплатыПоставщикам" Тогда 
			
			УстановитьСрокОплатыПоставщикам();
			
		ИначеЕсли ОбъектЗаполнения = "ТипЦенПлановойСебестоимостиНоменклатуры" Тогда 
			
			УстановитьТипЦенПлановойСебестоимостиНоменклатуры();
			
		ИначеЕсли ОбъектЗаполнения = "Банки" Тогда 
			
			УстановитьБанки();
			
		ИначеЕсли ОбъектЗаполнения = "БанковскиеСчета" Тогда 
			
			УстановитьБанковскиеСчета();
			
		ИначеЕсли ОбъектЗаполнения = "Валюты" Тогда 
			
			УстановитьВалюты();
			
		ИначеЕсли ОбъектЗаполнения = "ВидыНоменклатуры" Тогда 
			
			УстановитьВидыНоменклатуры();
			
		ИначеЕсли ОбъектЗаполнения = "ВидыПервичныхДокументов" Тогда 
			
			УстановитьВидыПервичныхДокументов();
			
		ИначеЕсли ОбъектЗаполнения = "ГодовыеГрафикиАмортизацииОС" Тогда 
			
			УстановитьГодовыеГрафикиАмортизацииОС();
			
		ИначеЕсли ОбъектЗаполнения = "ДокументыУдостоверяющиеЛичность" Тогда 
			
			УстановитьДокументыУдостоверяющиеЛичность();
			
		ИначеЕсли ОбъектЗаполнения = "ДолжностиОрганизаций" Тогда 
					
			УстановитьДолжностиОрганизаций();
			
		//ИначеЕсли ОбъектЗаполнения = "Кассы" Тогда 
		//			
		//	УстановитьКассы();
			
		ИначеЕсли ОбъектЗаполнения = "КлассификаторЕдиницИзмерения" Тогда 
					
			УстановитьКлассификаторЕдиницИзмерения();
					
		ИначеЕсли ОбъектЗаполнения = "КлассификаторСтранМира" Тогда 
			
			УстановитьКлассификаторСтранМира();
			
		ИначеЕсли ОбъектЗаполнения = "НалогиСборыОтчисления" Тогда 
			
			УстановитьНалогиСборыОтчисления();
			
		ИначеЕсли ОбъектЗаполнения = "Номенклатура" Тогда 
			
			УстановитьНоменклатура();
			
		ИначеЕсли ОбъектЗаполнения = "ПараметрыВыработкиОС" Тогда 
			
			УстановитьПараметрыВыработкиОС();
			
		//ИначеЕсли ОбъектЗаполнения = "ПодразделенияОрганизаций" Тогда 
		//	
		//	УстановитьПодразделенияОрганизаций();
			
		ИначеЕсли ОбъектЗаполнения = "ПричиныСписанияОС" Тогда 
			
			УстановитьПричиныСписанияОС();
			
		ИначеЕсли ОбъектЗаполнения = "Резервы" Тогда 
			
			УстановитьРезервы();
			
		ИначеЕсли ОбъектЗаполнения = "РолиКонтактныхЛиц" Тогда 
			
			УстановитьРолиКонтактныхЛиц();
			
		ИначеЕсли ОбъектЗаполнения = "СобытияОС" Тогда 
			
			УстановитьСобытияОС();
			
		ИначеЕсли ОбъектЗаполнения = "ТипыЦенНоменклатуры" Тогда 
			
			УстановитьТипыЦенНоменклатуры();
			
		ИначеЕсли ОбъектЗаполнения = "ФизическиеЛица" Тогда 
			
			УстановитьФизическиеЛица();
			
		ИначеЕсли ОбъектЗаполнения = "ФондыВыплатОрганизаций" Тогда 
			
			УстановитьФондыВыплатОрганизаций();
			
		ИначеЕсли ОбъектЗаполнения = "СчетаУчетаДенежныхСредств" Тогда 
			
			УстановитьСчетаУчетаДенежныхСредств();
			
		//ИначеЕсли ОбъектЗаполнения = "СчетаУчетаНоменклатуры" Тогда 
		//	
		//	УстановитьСчетаУчетаНоменклатуры();
			
		ИначеЕсли ОбъектЗаполнения = "КатегорииЗемель" Тогда 
			
			УстановитьКатегорииЗемель();
			
		//ИначеЕсли ОбъектЗаполнения = "УчетнаяПолитикаБухгалтерскийУчет" Тогда 
		//	
		//	УстановитьУчетнаяПолитикаБухгалтерскийУчет();
			
		ИначеЕсли ОбъектЗаполнения = "СтавкиНДС" Тогда 
			
			УстановитьСтавкиНДС();
			
		ИначеЕсли ОбъектЗаполнения = "Склады" Тогда 
			
			УстановитьСклады();
			
		//ИначеЕсли ОбъектЗаполнения = "СчетаУчетаРасчетовСКонтрагентами" Тогда 
		//	
		//	УстановитьСчетаУчетаРасчетовСКонтрагентами();  
			
		//ИначеЕсли ОбъектЗаполнения = "УчетнаяПолитикаНалоговыйУчет" Тогда 
		//	
		//	УстановитьУчетнаяПолитикаНалоговыйУчет();
			
		ИначеЕсли ОбъектЗаполнения = "СтатьиДвиженияДенежныхСредств" Тогда 
			
			УстановитьСтатьиДвиженияДенежныхСредств();
		
		КонецЕсли;
				
	КонецЦикла;
	
	    	
	
КонецПроцедуры

Процедура УстановитьДополнительнаяКолонкаПечатныхФормДокументов()
	
	Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Установить(Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код);
	
КонецПроцедуры

Процедура УстановитьПредставлениеНомераДокументов()
	
	Константы.ПредставлениеНомераДокументов.Установить(Перечисления.ВидыПредставленийНомеровДокументов.БезПрефиксаБезНулей);
	
КонецПроцедуры

Процедура УстановитьСрокОплатыПокупателей()
	
	Константы.СрокОплатыПокупателей.Установить(10);
	
КонецПроцедуры

Процедура УстановитьСрокОплатыПоставщикам()
	
	Константы.СрокОплатыПоставщикам.Установить(10);
	
КонецПроцедуры

Процедура УстановитьТипЦенПлановойСебестоимостиНоменклатуры()
	
	// Установка типов цен плановой себестоимости номенклатуры 
	СсылкаСправочника = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию(НСтр("ru = 'Плановая'"));
	ПустаяСсылка	  = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	Если СсылкаСправочника = ПустаяСсылка Тогда 
		ТипЦены = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
		ТипЦены.Наименование 			 = НСтр("ru = 'Плановая'");
		ТипЦены.ВалютаЦены 				 = Константы.ВалютаРегламентированногоУчета.Получить();
		ТипЦены.ЦенаВключаетАкциз 		 = Ложь;
		ТипЦены.ЦенаВключаетНДС 		 = Ложь;
		ТипЦены.ОкруглятьВБольшуюСторону = Ложь;
		ТипЦены.ПорядокОкругления 		 = Перечисления.ПорядкиОкругления.Окр0_01;
		ТипЦены.Записать();
	    Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Установить(ТипЦены.Ссылка);
	Иначе 
		Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Установить(СсылкаСправочника.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьБанки()
	
	// заполнение справочника банки
	СписокБанков = Новый СписокЗначений();
	СписокБанков.Добавить(НСтр("ru = 'АО ""Delta Bank"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""KASPI BANK"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Альянс Банк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""АТФБанк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Банк ЦентрКредит"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""БТА Банк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Евразийский банк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Жилстройсбербанк Казахстана"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""КАЗКОММЕРЦБАНК"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Народный Банк Казахстана"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Нурбанк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'ДО АО ""БТА  БАНК"" - АО ""ТЕМIРБАНК"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'АО ""Цеснабанк"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'ГУ Национальный Банк РК гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'ДБ АО ""Сбербанк России"" гр.'"));
	СписокБанков.Добавить(НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан"" гр.'"));
	
	СписокГруппССсылками = Новый Массив;
	
	Для Каждого СтрокаСписка Из СписокБанков Цикл 
		
		СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(СтрокаСписка);
		ПустаяСсылка = Справочники.Банки.ПустаяСсылка();
		
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникБанки = Справочники.Банки.СоздатьГруппу();
			СправочникБанки.Наименование = СтрокаСписка;
			СправочникБанки.Записать();
			СписокГруппССсылками.Добавить(СправочникБанки.Ссылка);
		Иначе 
			Если СсылкаДляПроверки.ЭтоГруппа Тогда 
				СписокГруппССсылками.Добавить(СсылкаДляПроверки);
			Иначе 
				
				ТекстСообщения = НСтр("ru='Банк с наименованием %1 уже создан. Группа для банка будет называться  %2 гр.'");
				Сообщение	   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаСписка, СтрокаСписка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);

				СправочникБанки = Справочники.Банки.СоздатьГруппу();
				СправочникБанки.Наименование = СтрокаСписка.Значение+" гр";
				СправочникБанки.Записать();
				СписокГруппССсылками.Добавить(СправочникБанки.Ссылка);
        	КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Справочник.Банки.ПФ_MXL_КлассификаторБанков");
    Область = Макет.ПолучитьОбласть("ОбластьРасшифровки");

	Для Ном = 1 По Область.ВысотаТаблицы Цикл 
		Если Найти( Область.Область(Ном, 3).Текст, "Delta Bank") > 0 Тогда 
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
			ПустаяСсылка = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(0);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес 		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, "KASPI BANK") > 0 Или Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Каспийский'")) > 0 Тогда 
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
            ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(1);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Альянс Банк'")) > 0 Тогда 
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(2);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'АТФБанк'")) > 0 Тогда  
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
            ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
			
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(3);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Банк ЦентрКредит'")) > 0 Тогда  
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
            ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
			
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(4);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес 		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'БТА Банк'")) > 0 И НЕ Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Темірбанк'")) > 0 Тогда  
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Лев(Область.Область(Ном, 3).Текст,100), Истина);
            ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(5);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Евразийский банк'")) > 0 Тогда  
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(6);
				СправочникБанки	  = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Жилстройсбербанк Казахстана'")) > 0 Тогда  
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(7);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес 		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
					
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'КАЗКОММЕРЦБАНК'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
			
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(8);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес 		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Народный Банк Казахстана'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(9);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес 		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Нурбанк'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка 	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(10);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'ТЕМIРБАНК'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(11);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Цеснабанк'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(12);
				СправочникБанки	  = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Национальный Банк РК'")) > 0 Тогда 	
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
		
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(13);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
						
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'Сбербанк России'")) > 0 Тогда
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
			
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(14);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК			 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
			
		ИначеЕсли Найти( Область.Область(Ном, 3).Текст, НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'")) > 0 Тогда
			
			СсылкаДляПроверки = Справочники.Банки.НайтиПоНаименованию(Область.Область(Ном, 3).Текст, Истина);
			ПустаяСсылка	  = Справочники.Банки.ПустаяСсылка();
			
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		    	ГруппаСправочника = СписокГруппССсылками.Получить(15);
				СправочникБанки   = Справочники.Банки.СоздатьЭлемент();
				СправочникБанки.Родитель 	 = ГруппаСправочника;
				СправочникБанки.Наименование = СокрЛП(Область.Область(Ном, 3).Текст);
				СправочникБанки.БИК 		 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникБанки.Адрес		 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникБанки.Записать();
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьБанковскиеСчета()
	
	// Заполнение банковских счетов
	
	СписокГрупп = Новый СписокЗначений();
	СписокГрупп.Добавить(НСтр("ru = 'Физические лица'"));
	СписокГрупп.Добавить(НСтр("ru = 'Юридические лица'"));
	СписокГруппССсылками = Новый Массив;
	
	Для Каждого Группа Из СписокГрупп Цикл
		
		СсылкаДляПроверки = Справочники.Контрагенты.НайтиПоНаименованию(Группа);
		ПустаяСсылка	  = Справочники.Контрагенты.ПустаяСсылка();
		
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникГруппа = Справочники.Контрагенты.СоздатьГруппу();
			СправочникГруппа.Наименование = Группа;
			СправочникГруппа.Записать();
			СписокГруппССсылками.Добавить(СправочникГруппа.Ссылка);
		Иначе 
			СписокГруппССсылками.Добавить(СсылкаДляПроверки);
		КонецЕсли;
				
	КонецЦикла;
	
	СсылкаДляПроверки = Справочники.Контрагенты.НайтиПоНаименованию(НСтр("ru = 'ГК ПДГ'"));
	ПустаяСсылка 	  = Справочники.Контрагенты.ПустаяСсылка();
	
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
		СправочникЭлемент.Наименование 				   = НСтр("ru = 'ГК ПДГ'");
		СправочникЭлемент.ЮрФизЛицо 				   = Перечисления.ЮрФизЛицо.ЮрЛицо;
		СправочникЭлемент.Родитель 					   = СписокГруппССсылками[1];
		СправочникЭлемент.НаименованиеПолное 		   = НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'");
		СправочникЭлемент.КБЕ 						   = "11";
		СправочникЭлемент.ИдентификационныйКодЛичности = "160440007161";
		СправочникЭлемент.СтранаРезидентства		   = Справочники.КлассификаторСтранМира.Казахстан;
		СправочникЭлемент.Записать();
		СправочникЭлемент.ГоловнойКонтрагент = СправочникЭлемент.Ссылка;
		СправочникЭлемент.Записать();
		СсылкаГЦВП = СправочникЭлемент.Ссылка;
	Иначе 
		СсылкаГЦВП = СсылкаДляПроверки;
	КонецЕсли;
	
	
	СсылкаДляПроверки = Справочники.БанковскиеСчета.НайтиПоНаименованию(НСтр("ru = 'Для ОПВ'"));
	ПустаяСсылка	  = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.БанковскиеСчета.СоздатьЭлемент();
		СправочникЭлемент.Наименование			= НСтр("ru = 'Для ОПВ'");
		СправочникЭлемент.Владелец				= СсылкаГЦВП;
		СправочникЭлемент.Банк 					= Справочники.Банки.НайтиПоНаименованию(НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'"));
		СправочникЭлемент.НомерСчета			= "КZ12009NPS0413609816";
		СправочникЭлемент.ВидСчета				= НСтр("ru = 'Расчетный'");
		СправочникЭлемент.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить();
		СправочникЭлемент.МесяцПрописью			= Истина;
		СправочникЭлемент.ТекстКорреспондента 	= НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'");
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	
	СсылкаДляПроверки = Справочники.БанковскиеСчета.НайтиПоНаименованию(НСтр("ru = 'Для СО'"));
	ПустаяСсылка 	  = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.БанковскиеСчета.СоздатьЭлемент();
		СправочникЭлемент.Наименование			= НСтр("ru = 'Для СО'");
		СправочникЭлемент.Владелец				= СсылкаГЦВП;
		СправочникЭлемент.Банк 					= Справочники.Банки.НайтиПоНаименованию(НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'"));
		СправочникЭлемент.НомерСчета			= "КZ67009SS00368609110";
		СправочникЭлемент.ВидСчета				= НСтр("ru = 'Расчетный'");
		СправочникЭлемент.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить();
		СправочникЭлемент.МесяцПрописью			= Истина;
		СправочникЭлемент.ТекстКорреспондента 	= НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'");
		СправочникЭлемент.Записать();
		
		//СправочникЭлемент = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		//СправочникЭлемент.Владелец 				= СсылкаГЦВП;
		//СправочникЭлемент.Организация 			= Объект.Организация.Ссылка;
		//СправочникЭлемент.Наименование			= НСтр("ru = 'Без договора'");
		//СправочникЭлемент.ВидДоговора			= Перечисления.ВидыДоговоровКонтрагентов.Прочее;
		//СправочникЭлемент.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		//СправочникЭлемент.ВалютаВзаиморасчетов 	= Константы.ВалютаРегламентированногоУчета.Получить();
		//СправочникЭлемент.Записать();

	КонецЕсли;
	
	
	СсылкаДляПроверки = Справочники.БанковскиеСчета.НайтиПоНаименованию(НСтр("ru = 'Для ОСМС и ВОСМС'"));
	ПустаяСсылка 	  = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.БанковскиеСчета.СоздатьЭлемент();
		СправочникЭлемент.Наименование			= НСтр("ru = 'Для ОСМС и ВОСМС'");
		СправочникЭлемент.Владелец				= СсылкаГЦВП;
		СправочникЭлемент.Банк 					= Справочники.Банки.НайтиПоНаименованию(НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'"));
		СправочникЭлемент.НомерСчета			= "KZ92009MEDS368609103";
		СправочникЭлемент.ВидСчета				= НСтр("ru = 'Расчетный'");
		СправочникЭлемент.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить();
		СправочникЭлемент.МесяцПрописью			= Истина;
		СправочникЭлемент.ТекстКорреспондента 	= НСтр("ru = 'НАО ""Государственная корпорация ""Правительство для граждан""'");
		СправочникЭлемент.Записать();
	КонецЕсли;
			
КонецПроцедуры

Процедура УстановитьВалюты()
	
	// Справочник валюты
	Попытка
		СправочникЭлемент = Справочники.Валюты.СоздатьЭлемент();
		СправочникЭлемент.БуквенныйКод				= "USD";
		СправочникЭлемент.Код						= "840";
		СправочникЭлемент.Наименование				= "USD";
		СправочникЭлемент.НаименованиеПолное 		= НСтр("ru = 'Доллар США'");
		СправочникЭлемент.ПараметрыПрописиНаРусском = НСтр("ru = 'доллар'") + ", "
		+ НСтр("ru = 'доллара'") + ", "
		+ НСтр("ru = 'долларов'") + ", "
		+ НСтр("ru = 'м'") + ", "
		+ НСтр("ru = 'цент'") + ", "
		+ НСтр("ru = 'цента'") + ", "
		+ НСтр("ru = 'центов'") + ", "
		+ НСтр("ru = 'м'") + ", "
		+ "2";
		СправочникЭлемент.Записать();
		ОбщегоНазначенияБК.ПроверитьКорректностьКурсаНа01_01_1980(СправочникЭлемент.Ссылка);
	Исключение
	КонецПопытки;
	
	Попытка
		СправочникЭлемент = Справочники.Валюты.СоздатьЭлемент();
		СправочникЭлемент.БуквенныйКод				= "RUB";
		СправочникЭлемент.Код						= "643";
		СправочникЭлемент.Наименование				= "RUB";
		СправочникЭлемент.НаименованиеПолное		= НСтр("ru = 'Российский рубль'");
		СправочникЭлемент.ПараметрыПрописиНаРусском = НСтр("ru = 'рубль'") + ", "
		+ НСтр("ru = 'рубля'") + ", "
		+ НСтр("ru = 'рублей'") + ", "
		+ НСтр("ru = 'м'") + ", "
		+ НСтр("ru = 'копейка'") + ", "
		+ НСтр("ru = 'копейки'") + ", "
		+ НСтр("ru = 'копеек'") + ", "
		+ НСтр("ru = 'ж'") + ", "
		+ "2";
		СправочникЭлемент.Записать();
		ОбщегоНазначенияБК.ПроверитьКорректностьКурсаНа01_01_1980(СправочникЭлемент.Ссылка);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьВидыНоменклатуры()
	
	// Справочник ВидыНоменклатуры 
	Попытка
		Для Каждого ТМЗ Из Перечисления.ГруппыТМЗ Цикл 
			ТМЗДляПроверки 	  = Лев(ТМЗ,50);
			СсылкаДляПроверки = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(ТМЗДляПроверки);
			ПустаяСсылка 	  = Справочники.ВидыНоменклатуры.ПустаяСсылка();
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
				СправочникЭлемент = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
				СправочникЭлемент.Наименование = ТМЗ;
				СправочникЭлемент.ГруппаТМЗ    = ТМЗ;
				СправочникЭлемент.Записать();
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьВидыПервичныхДокументов()
	
	// справочник ВидыПервичныхДокументов
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Акт закупа'"));
	Список.Добавить(НСтр("ru = 'Акт выполненных работ'"));
	Список.Добавить(НСтр("ru = 'Квитанция'"));

	Для Каждого Строка Из Список Цикл
		СсылкаДляПроверки = Справочники.ВидыПервичныхДокументов.НайтиПоНаименованию(Строка);
		ПустаяСсылка	  = Справочники.ВидыПервичныхДокументов.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда
			СправочникЭлемент = Справочники.ВидыПервичныхДокументов.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка;
		    СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьГодовыеГрафикиАмортизацииОС()
	
	// справочник ГодовыеГрафикиАмортизацииОС
	СсылкаДляПроверки = Справочники.ГодовыеГрафикиАмортизацииОС.НайтиПоНаименованию(НСтр("ru = 'Линейный'"));
	ПустаяСсылка = Справочники.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
		СправочникЭлемент = Справочники.ГодовыеГрафикиАмортизацииОС.СоздатьЭлемент();
		СправочникЭлемент.Наименование  = НСтр("ru = 'Линейный'");
		СправочникЭлемент.Комментарий   = НСтр("ru = 'равномерно в течение года'");
		СправочникЭлемент.Коэффициент1  = 1;
		СправочникЭлемент.Коэффициент2  = 1;
		СправочникЭлемент.Коэффициент3  = 1;
		СправочникЭлемент.Коэффициент4  = 1;
		СправочникЭлемент.Коэффициент5  = 1;
		СправочникЭлемент.Коэффициент6  = 1;
		СправочникЭлемент.Коэффициент7  = 1;
		СправочникЭлемент.Коэффициент8  = 1;
		СправочникЭлемент.Коэффициент9  = 1;
		СправочникЭлемент.Коэффициент10 = 1;
		СправочникЭлемент.Коэффициент11 = 1;
		СправочникЭлемент.Коэффициент12 = 1;
	    СправочникЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДокументыУдостоверяющиеЛичность()
	
	// Справочник ДокументыУдостоверяющиеЛичность
	Список = Новый СписокЗначений();
	Список.Добавить("000004","Вид на жительство");
	Список.Добавить("000002","Удостоверение личности");
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.ДокументыУдостоверяющиеЛичность.НайтиПоНаименованию(Строка.Представление);
		ПустаяСсылка 	  = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.ДокументыУдостоверяющиеЛичность.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка.Представление;
			СправочникЭлемент.Код		   = Строка.Значение;
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьДолжностиОрганизаций()
	
	// Справочник ДолжностиОрганизаций
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Бухгалтер'"));
	Список.Добавить(НСтр("ru = 'Кассир'"));
	Список.Добавить(НСтр("ru = 'Кладовщик'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию(Строка);
		ПустаяСсылка	  = Справочники.ДолжностиОрганизаций.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка;
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьКлассификаторЕдиницИзмерения()
	
	// Справочник КлассификаторЕдиницИзмерения
	Список = Новый СписокЗначений();
	Список.Добавить("166", НСтр("ru = 'кг_Килограмм'"));
	Список.Добавить("008", НСтр("ru = 'км_Километр'"));
	Список.Добавить("112", НСтр("ru = 'л_Литр'"));
	Список.Добавить("006", НСтр("ru = 'м_Метр'"));
	Список.Добавить("055", НСтр("ru = 'м2_Квадратный метр'"));
	Список.Добавить("113", НСтр("ru = 'м3_Кубический метр'"));
	Список.Добавить("168", НСтр("ru = 'т_Тонна'"));
	Список.Добавить("356", НСтр("ru = 'ч_Час'"));
	Список.Добавить("796", НСтр("ru = 'шт_Штука'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Сред(Строка.Представление, 1, Найти(Строка.Представление, "_") - 1));
		ПустаяСсылка	  = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда
			СправочникЭлемент = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			СправочникЭлемент.Код 				 = Строка.Значение;
			СправочникЭлемент.Наименование 		 = Сред(Строка.Представление, 1, Найти(Строка.Представление, "_") - 1);
			СправочникЭлемент.НаименованиеПолное = Сред(Строка.Представление, Найти(Строка.Представление, "_") + 1,СтрДлина(Строка.Представление)); 
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ЭСФСерверПереопределяемый.ЗаполнитьКодыЭСФЕдиницИзмерения();
		
КонецПроцедуры

Процедура УстановитьКлассификаторСтранМира()
	
	// Справочник КлассификаторСтранМира
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.КлассификаторСтранМира.ПФ_MXL_КлассификаторСтранМира");
    Область = Макет.ПолучитьОбласть("ОбластьРасшифровки");

	Для Ном = 1 По Область.ВысотаТаблицы Цикл 
		Код = СокрЛП(Область.Область(Ном, 1).Текст);
		Если Код = "112" Или Код = "417" Или Код = "156" Или Код = "498" Или Код = "643" Или Код = "762" Или Код = "795" Или Код = "860" Или Код = "804" Тогда 
			СсылкаДляПроверки = Справочники.КлассификаторСтранМира.НайтиПоКоду(СокрЛП(Область.Область(Ном, 1).Текст));
			ПустаяСсылка = Справочники.КлассификаторСтранМира.ПустаяСсылка();
			Если СсылкаДляПроверки = ПустаяСсылка Тогда 
            	СправочникЭлемент = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
				СправочникЭлемент.Наименование		 = СокрЛП(Область.Область(Ном, 2).Текст);
				СправочникЭлемент.Код				 = СокрЛП(Область.Область(Ном, 1).Текст); 
				СправочникЭлемент.КодАльфа2			 = СокрЛП(Область.Область(Ном, 3).Текст); 
				СправочникЭлемент.КодАльфа3			 = СокрЛП(Область.Область(Ном, 4).Текст); 
				СправочникЭлемент.НаименованиеПолное = СокрЛП(Область.Область(Ном, 5).Текст);  
				СправочникЭлемент.Записать();
			КонецЕсли;
		КонецЕсли;                   
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьНалогиСборыОтчисления()
	
	//  Справочник НалогиСборыОтчисления
	СсылкаДляПроверки = Справочники.НалогиСборыОтчисления.НайтиПоНаименованию(НСтр("ru = 'Земельный налог'"));
	ПустаяСсылка = Справочники.НалогиСборыОтчисления.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.НалогиСборыОтчисления.СоздатьЭлемент();
		СправочникЭлемент.Наименование					   = НСтр("ru = 'Земельный налог'");
		СправочникЭлемент.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.ЗемельныйНалог;
		СправочникЭлемент.СчетУчетаРасчетовСКонтрагентомНУ = ПланыСчетов.Налоговый.ПрочиеНалоги;
		СправочникЭлемент.КодБК							   = "104308";
		СправочникЭлемент.КодНазначенияПлатежа			   = "911";
		СправочникЭлемент.НазначениеПлатежа	  			   = НСтр("ru = 'Земельный налог за'");
		СправочникЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНоменклатура()
	
	// Справочник номенклатура
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Товары'"));
	Список.Добавить(НСтр("ru = 'Материалы'"));
	Список.Добавить(НСтр("ru = 'Готовая продукция'"));
	Список.Добавить(НСтр("ru = 'Услуги'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.Номенклатура.НайтиПоНаименованию(Строка);
		ПустаяСсылка = Справочники.Номенклатура.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникГруппа = Справочники.Номенклатура.СоздатьГруппу();
			СправочникГруппа.Наименование = Строка;
			СправочникГруппа.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Собственные услуги'"));
	Список.Добавить(НСтр("ru = 'Услуги сторонних организаций'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.Номенклатура.НайтиПоНаименованию(НСтр("ru = 'Услуги'"));
		ПустаяСсылка	  = Справочники.Номенклатура.ПустаяСсылка();
		Если СсылкаДляПроверки <> ПустаяСсылка Тогда 
			СсылкаДляПроверкиГруппы = Справочники.Номенклатура.НайтиПоНаименованию(Строка);
			Если СсылкаДляПроверкиГруппы = ПустаяСсылка Тогда
				СправочникГруппа = Справочники.Номенклатура.СоздатьГруппу();
			    СправочникГруппа.Наименование = Строка;
				СправочникГруппа.Родитель 	  = СсылкаДляПроверки;
				СправочникГруппа.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПараметрыВыработкиОС()
	
	// Справочник ПараметрыВыработкиОС
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'километраж'") ,НСтр("ru = 'км'"));
    Список.Добавить(НСтр("ru = 'число копий'"),НСтр("ru = 'шт'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.ПараметрыВыработкиОС.НайтиПоНаименованию(Строка.Значение);
		ПустаяСсылка	  = Справочники.ПараметрыВыработкиОС.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.ПараметрыВыработкиОС.СоздатьЭлемент();
			СправочникЭлемент.Наименование	   = Строка.Значение;
			СправочникЭлемент.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Строка.Представление);
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьПричиныСписанияОС()
	
	// Справочник ПричиныСписанияОС
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'физический износ'"));
    Список.Добавить(НСтр("ru = 'моральное устаревание'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.ПричиныСписанияОС.НайтиПоНаименованию(Строка);
		ПустаяСсылка 	  = Справочники.ПричиныСписанияОС.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.ПричиныСписанияОС.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка;
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьРезервы()
	
	// Справочник Резервы
	БазовыеРасчеты = Новый Массив();
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладОтОбратного);
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладОтОбратногоПоДням);
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладОтОбратногоПоЧасам);
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	БазовыеРасчеты.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	
	Наименование 	  = НСтр("ru = 'Резерв отпусков'");
	СсылкаДляПроверки = Справочники.Резервы.НайтиПоНаименованию(Наименование);
	ПустаяСсылка	  = Справочники.Резервы.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.Резервы.СоздатьЭлемент();
		СправочникЭлемент.Наименование = Наименование;
		СправочникЭлемент.ВидРезерва   = Перечисления.ВидыРезервов.ПоВознаграждениямРаботникам; 
		Для Каждого Строка Из БазовыеРасчеты Цикл 
			
			СтрокаТЧ = СправочникЭлемент.БазовыеВидыРасчета.Добавить();
			СтрокаТЧ.ВидРасчета = Строка;
			
		КонецЦикла;
		СправочникЭлемент.Записать();
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьРолиКонтактныхЛиц()
	
	// Справочник РолиКонтактныхЛиц
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Бухгалтер'"));
    Список.Добавить(НСтр("ru = 'Директор'"));
	Список.Добавить(НСтр("ru = 'Менеджер'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.РолиКонтактныхЛиц.НайтиПоНаименованию(Строка);
		ПустаяСсылка	  = Справочники.РолиКонтактныхЛиц.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.РолиКонтактныхЛиц.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка;
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСобытияОС()
	
	// Справочник СобытияОС
	События = Перечисления.ВидыСобытийОС;
	
	Для Каждого Строка Из События Цикл 
		СсылкаДляПроверки = Справочники.СобытияОС.НайтиПоНаименованию(Строка);
		ПустаяСсылка 	  = Справочники.СобытияОС.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникЭлемент = Справочники.СобытияОС.СоздатьЭлемент();
			СправочникЭлемент.Наименование = Строка;
			СправочникЭлемент.ВидСобытияОС = Строка;
			СправочникЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьТипыЦенНоменклатуры()
	
	// справочники Установка типов цен
	СсылкаСправочника = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию(НСтр("ru = 'Приходная'"));
	ПустаяСсылка 	  = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	Если СсылкаСправочника = ПустаяСсылка Тогда 
		ТипЦены = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
		ТипЦены.Наименование 			 = НСтр("ru = 'Приходная'");
		ТипЦены.ВалютаЦены				 = Константы.ВалютаРегламентированногоУчета.Получить();
		ТипЦены.ЦенаВключаетАкциз 		 = Ложь;
		ТипЦены.ЦенаВключаетНДС			 = Ложь;
		ТипЦены.ОкруглятьВБольшуюСторону = Истина;
		ТипЦены.ПорядокОкругления 		 = Перечисления.ПорядкиОкругления.Окр0_01;
		ТипЦены.Записать();
	КонецЕсли;

	СсылкаСправочника = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию(НСтр("ru = 'Оптовая'"));
	ПустаяСсылка	  = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	Если СсылкаСправочника = ПустаяСсылка Тогда 
		ТипЦены = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
		ТипЦены.Наименование 			 = НСтр("ru = 'Оптовая'");
		ТипЦены.ВалютаЦены 				 = Константы.ВалютаРегламентированногоУчета.Получить();
		ТипЦены.ЦенаВключаетАкциз		 = Ложь;
		ТипЦены.ЦенаВключаетНДС 		 = Ложь;
		ТипЦены.ОкруглятьВБольшуюСторону = Истина;
		ТипЦены.ПорядокОкругления		 = Перечисления.ПорядкиОкругления.Окр1;
		ТипЦены.Записать();
	КонецЕсли;

    СсылкаСправочника = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию(НСтр("ru = 'Розничная'"));
	ПустаяСсылка	  = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	Если СсылкаСправочника = ПустаяСсылка Тогда 
		ТипЦены = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
		ТипЦены.Наименование 			 = НСтр("ru = 'Розничная'");
		ТипЦены.ВалютаЦены				 = Константы.ВалютаРегламентированногоУчета.Получить();
		ТипЦены.ЦенаВключаетАкциз		 = Ложь;
		ТипЦены.ЦенаВключаетНДС			 = Ложь;
		ТипЦены.ОкруглятьВБольшуюСторону = Истина;
		ТипЦены.ПорядокОкругления		 = Перечисления.ПорядкиОкругления.Окр1;
		ТипЦены.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьФизическиеЛица()
	
	// Справочники ФизическиеЛица
	Список = Новый СписокЗначений();
	Список.Добавить(НСтр("ru = 'Сотрудники'"));
    Список.Добавить(НСтр("ru = 'Сторонние физ. лица'"));
	Список.Добавить(НСтр("ru = 'Уволенные сотрудники'"));
	
	Для Каждого Строка Из Список Цикл 
		СсылкаДляПроверки = Справочники.ФизическиеЛица.НайтиПоНаименованию(Строка);
		ПустаяСсылка 	  = Справочники.ФизическиеЛица.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда
			СправочникГруппа = Справочники.ФизическиеЛица.СоздатьГруппу();
			СправочникГруппа.Наименование = Строка;
			СправочникГруппа.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьФондыВыплатОрганизаций()
	
	// Справочники  ФондыВыплатОрганизаций
	Наименование	  = НСтр("ru = 'Фонд заработной платы'");
	СсылкаДляПроверки = Справочники.ФондыВыплатОрганизаций.НайтиПоНаименованию(Наименование);
	ПустаяСсылка	  = Справочники.ФондыВыплатОрганизаций.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
		СправочникГруппа = Справочники.ФондыВыплатОрганизаций.СоздатьЭлемент();
		СправочникГруппа.Наименование		 = Наименование;
		СправочникГруппа.ФондЗаработнойПлаты = Истина;
		СправочникГруппа.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСчетаУчетаДенежныхСредств()
	
	Попытка
		СчетКассы = РегистрыСведений.СчетаУчетаДенежныхСредств.СоздатьМенеджерЗаписи();
		СчетКассы.Период = ТекущаяДата();
		СчетКассы.ОбъектУчета = Справочники.Кассы.НайтиПоНаименованию(НСтр("ru = 'Основная касса'"));
		СчетКассы.СчетУчетаБУ = ПланыСчетов.Типовой.ДенежныеСредстваВКассе;
		СчетКассы.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Не создан счет учета денежных средств.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
		
КонецПроцедуры

Процедура УстановитьКатегорииЗемель()
	
	СсылкаДляПроверки = Справочники.КатегорииЗемель.НайтиПоНаименованию(НСтр("ru = 'ЗНП'"));
	ПустаяСсылка 	  = Справочники.КатегорииЗемель.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
		ЗаписьСправочника = Справочники.КатегорииЗемель.СоздатьЭлемент();
		ЗаписьСправочника.КодПоКлассификатору = НСтр("ru = 'ЗНП'");
		ЗаписьСправочника.ПолноеНаименование  = НСтр("ru = 'Земли населенных пунктов, за исключением земель, занятых жилищным фондом, в том числе строениями и сооружениями при нем.'");
		ЗаписьСправочника.ВидЗемельногоНалога = Справочники.НалогиСборыОтчисления.НайтиПоНаименованию(НСтр("ru = 'Земельный налог'"));
		ЗаписьСправочника.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.КатегорииЗемель.НайтиПоНаименованию(НСтр("ru = 'ЗНП-ПУ'"));
	ПустаяСсылка 	  = Справочники.КатегорииЗемель.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
		ЗаписьСправочника = Справочники.КатегорииЗемель.СоздатьЭлемент();
		ЗаписьСправочника.КодПоКлассификатору = НСтр("ru = 'ЗНП-ПУ'");
		ЗаписьСправочника.ПолноеНаименование  = НСтр("ru = 'Земли населенных пунктов - придомовые земельные участки.'");
		ЗаписьСправочника.ВидЗемельногоНалога = Справочники.НалогиСборыОтчисления.НайтиПоНаименованию(НСтр("ru = 'Земельный налог'"));
		ЗаписьСправочника.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.КатегорииЗемель.НайтиПоНаименованию(НСтр("ru = 'ЗП-НП'"));
	ПустаяСсылка 	  = Справочники.КатегорииЗемель.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
		ЗаписьСправочника = Справочники.КатегорииЗемель.СоздатьЭлемент();
		ЗаписьСправочника.КодПоКлассификатору = НСтр("ru = 'ЗП-НП'");
		ЗаписьСправочника.ПолноеНаименование  = НСтр("ru = 'Земли промышленности, расположенные в черте населенных пунктов.'");
		ЗаписьСправочника.ВидЗемельногоНалога = Справочники.НалогиСборыОтчисления.НайтиПоНаименованию(НСтр("ru = 'Земельный налог'"));
		ЗаписьСправочника.Записать();
	КонецЕсли;
	
		
КонецПроцедуры

Процедура УстановитьСтавкиНДС()
	
	// Справочник ставки ндс
	СсылкаДляПроверки = Справочники.СтавкиНДС.НайтиПоНаименованию("0%");
	ПустаяСсылка	  = Справочники.СтавкиНДС.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
    	НовыйЭлемент = Справочники.СтавкиНДС.СоздатьЭлемент();
		НовыйЭлемент.ДляОсвобожденногоОборота = Ложь;
		НовыйЭлемент.МестоРеализацииНеРК      = Ложь;
		НовыйЭлемент.Ставка					  = 0;
		НовыйЭлемент.Наименование			  = "0%";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтавкиНДС.НайтиПоНаименованию("12%");
	ПустаяСсылка 	  = Справочники.СтавкиНДС.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
    	НовыйЭлемент = Справочники.СтавкиНДС.СоздатьЭлемент();
		НовыйЭлемент.ДляОсвобожденногоОборота = Ложь;
		НовыйЭлемент.МестоРеализацииНеРК      = Ложь;
		НовыйЭлемент.Ставка					  = 12;
		НовыйЭлемент.Наименование			  = "12%";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтавкиНДС.НайтиПоНаименованию(НСтр("ru = 'без НДС'"));
	ПустаяСсылка	  = Справочники.СтавкиНДС.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
    	НовыйЭлемент = Справочники.СтавкиНДС.СоздатьЭлемент();
		НовыйЭлемент.ДляОсвобожденногоОборота = Истина;
		НовыйЭлемент.МестоРеализацииНеРК      = Ложь;
		НовыйЭлемент.Ставка					  = 0;
		НовыйЭлемент.Наименование 			  = НСтр("ru = 'без НДС'");
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтавкиНДС.НайтиПоНаименованию(НСтр("ru = 'без НДС - не РК'"));
	ПустаяСсылка	  = Справочники.СтавкиНДС.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
    	НовыйЭлемент = Справочники.СтавкиНДС.СоздатьЭлемент();
		НовыйЭлемент.ДляОсвобожденногоОборота = Ложь;
		НовыйЭлемент.МестоРеализацииНеРК      = Истина;
		НовыйЭлемент.Ставка					  = 0;
		НовыйЭлемент.Наименование 			  = НСтр("ru = 'без НДС - не РК'");
		НовыйЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСклады()
	
	// Справочник склады
	СсылкаДляПроверки = Справочники.Склады.НайтиПоНаименованию(НСтр("ru = 'Основной склад'"));
	ПустаяСсылка	  = Справочники.Склады.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда
    	НовыйЭлемент = Справочники.Склады.СоздатьЭлемент();
		НовыйЭлемент.Наименование = НСтр("ru = 'Основной склад'");
		НовыйЭлемент.Комментарий  = НСтр("ru = 'Основной склад организации'");
		НовыйЭлемент.Записать();
	КонецЕсли;
			
КонецПроцедуры

Процедура УстановитьОсновныеНачисленияОрганизаций()
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000001");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000002");
		ЗаписьРегистра.Период     = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.015";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000003");
		ЗаписьРегистра.Период 	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.015";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000004");
		ЗаписьРегистра.Период 	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.035";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000005");
		ЗаписьРегистра.Период 	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000006");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.013";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000007");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.008";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000008");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000009");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000010");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000011");
		ЗаписьРегистра.Период 	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.001";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000012");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.008";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
	
	Попытка
		ЗаписьРегистра = РегистрыСведений.КодыСтрокДекларацииПоСН.СоздатьМенеджерЗаписи();
		СсылкаНаРасчет = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("000013");
		ЗаписьРегистра.Период	  = ТекущаяДата();
		ЗаписьРегистра.ВидРасчета = СсылкаНаРасчет;
		ЗаписьРегистра.КодСтроки  = "200.02.008";
		ЗаписьРегистра.Записать();
	Исключение
	КонецПопытки;
		
КонецПроцедуры

Процедура УстановитьСтатьиДвиженияДенежныхСредств()
	
	СписокГрупп = Новый СписокЗначений();
	СписокГрупп.Добавить(НСтр("ru = 'Инвестиционная деятельность'"));
	СписокГрупп.Добавить(НСтр("ru = 'Операционная деятельность'"));
	СписокГрупп.Добавить(НСтр("ru = 'Финансовая деятельность'"));
	СписокГруппССсылками = Новый Массив;
	
	Для Каждого Группа Из СписокГрупп Цикл
		
		СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(Группа);
		ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		Если СсылкаДляПроверки = ПустаяСсылка Тогда 
			СправочникГруппа = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьГруппу();
			СправочникГруппа.Наименование = Группа;
			СправочникГруппа.Записать();
			СписокГруппССсылками.Добавить(СправочникГруппа.Ссылка);
		Иначе 
			СписокГруппССсылками.Добавить(СсылкаДляПроверки);
		КонецЕсли;
				
	КонецЦикла;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплаты по опционам и свопам'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Выплаты по опционам и свопам'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Фьючерсные и форвардные контракты, опционы и свопы'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Погашение предоставленных займов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Погашение предоставленных займов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Погашение займов, предоставленных другим организациям'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Поступление по фьючерсным  контрактам'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Поступление по фьючерсным  контрактам'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Фьючерсные и форвардные контракты, опционы и свопы'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Предоставление займов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Предоставление займов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Предоставление займов другим организациям'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение других долгосрочных активов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Приобретение других долгосрочных активов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение других долгосрочных активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение нематериальных активов'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Приобретение нематериальных активов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение нематериальных активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение основных средств'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Приобретение основных средств'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение основных средств'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение финансовых активов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Приобретение финансовых активов'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение финансовых активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты по инвестиционной деятельности'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Прочие выплаты по инвестиционной деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения 			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты от инвестиционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от инвестиционной деятельности'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Прочие поступления от инвестиционной деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от инвестиционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация нематериальных актвивов'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация нематериальных актвивов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения 			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация нематериальных активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация основных средств'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация основных средств'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация основных средств'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

    СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация прочих долгосрочных активов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация прочих долгосрочных активов'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация других долгосрочных активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

    СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация финансовых активов'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация финансовых активов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(0);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Инвестиционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация финансовых активов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Авансы выданные под поставку активов и услуг'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Авансы выданные под поставку активов и услуг'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Авансы выданные'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Авансы полученные под поставку активов и услуг'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Авансы полученные под поставку активов и услуг'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Авансы полученные'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплата вознаграждения по займам'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Выплата вознаграждения по займам'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплата вознаграждения по займам'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплата заработной платы'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Выплата заработной платы'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплаты по заработной плате'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Зачисление кассовой выручки на расчетный счет'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Зачисление кассовой выручки на расчетный счет'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты от операционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Поступление денежных средств с расчетного счета'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Поступление денежных средств с расчетного счета'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от операционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Поступление дивидендов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Поступление дивидендов'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Дивиденды'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты по операционной деятельности'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Прочие выплаты по операционной деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты от операционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от операционной деятельности'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Прочие поступления от операционной деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от операционной деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Расчеты с бюджетом по корпоративному подоходному налогу'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Расчеты с бюджетом по корпоративному подоходному налогу'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения 			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Корпоративный подоходный налог'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Расчеты с бюджетом по налогам'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Расчеты с бюджетом по налогам'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Другие платежи в бюджет'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Расчеты с поставщиками и подрядчиками'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Расчеты с поставщиками и подрядчиками'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Платежи поставщикам за товары и услуги'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация готовой продукции и товаров'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация готовой продукции и товаров'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация товаров'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

    СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Реализация работ и услуг'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Реализация работ и услуг'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(1);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Операционная;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Предоставление услуг'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	
	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплата дивидендов'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Выплата дивидендов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Выплата дивидендов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

   	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Погашение займов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Погашение займов'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения 			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Погашение займов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Получение вознаграждения по финансируемой аренде'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Получение вознаграждения по финансируемой аренде'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Получение вознаграждения по финансируемой аренде'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Получение займов'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Получение займов'");
		СправочникЭлемент.Родитель 				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Получение займов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение собственных акций'"));
	ПустаяСсылка 	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Приобретение собственных акций'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Приобретение собственных акций'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

    СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Процент по кредитам'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Процент по кредитам'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Погашение займов'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты по финансовой деятельности'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Прочие выплаты по финансовой деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Выбытие;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие выплаты от финансовой деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от финансовой деятельности'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование			  = НСтр("ru = 'Прочие поступления от финансовой деятельности'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Прочие поступления от финансовой деятельности'"));
		СправочникЭлемент.Записать();
	КонецЕсли;

	СсылкаДляПроверки = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Эмиссия акций и др. ценных бумаг'"));
	ПустаяСсылка	  = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Если СсылкаДляПроверки = ПустаяСсылка Тогда 
		СправочникЭлемент = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		СправочникЭлемент.Наименование 			  = НСтр("ru = 'Эмиссия акций и др. ценных бумаг'");
		СправочникЭлемент.Родитель				  = СписокГруппССсылками.Получить(2);
		СправочникЭлемент.РазрезДеятельности 	  = Перечисления.РазрезыДеятельности.Финансовая;
		СправочникЭлемент.ВидДвижения 			  = Перечисления.ВидыДвиженийДенежныхСредств.Поступление;
		СправочникЭлемент.ДвижениеДенежныхСредств = Справочники.ДвиженияДенежныхСредств.НайтиПоНаименованию(НСтр("ru = 'Эмиссия акций и  других ценных бумаг'"));
		СправочникЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли