
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не Справочники.Склады.ИспользуетсяНесколькоСкладов() Тогда
		СкладПоУмолчанию = Справочники.Склады.ПолучитьСкладПоУмолчанию();
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если НЕ ЗначениеЗаполнено(Запись.СтруктурнаяЕдиница) Тогда
				Запись.СтруктурнаяЕдиница = СкладПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецЕсли

