#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИсключаемыеЗначения = ВССерверПереопределяемый.МассивИсключаемыхСпособовЗаполненияЦен();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.СпособЗаполненияЦеныЭДВС Цикл
		Если ИсключаемыеЗначения.Найти(ЗначениеПеречисления) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;
	КонецЦикла;			
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли

