#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет использованные коды маркировки из пула в случаях:
//   * Все коды маркировки по основанию распечатаны, основание полностью оформлено (по основанию)
//   * Основание не указано или архивировано, коды маркировки распечатаны (по использованным кодам).
//
Процедура ПолучитьИнформациюПоСтатусамНанесения() Экспорт
	
	НастройкаОбменаСУЗ = ИнтерфейсИСМПТК.НастройкиОбменаСУЗ();
	
	Если НастройкаОбменаСУЗ = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не определена настройка взаимодействия с СУЗ'");
		ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения);
		
		ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения,  "Ошибка регламентного задания обновление статусов документов СУЗ");
		
	Иначе
		
		Если ТипЗнч(НастройкаОбменаСУЗ) = Тип("Массив") Тогда
			Для Каждого Настройка Из НастройкаОбменаСУЗ Цикл
				ПолучитьИнформациюПоСтатусамНанесенияПродолжить(Настройка);
			КонецЦикла;
		Иначе
			ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НанесениеКодовМаркировкиСУЗИСМПТК.OrderID КАК OrderID,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.Статус КАК Статус,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.Ссылка КАК Ссылка,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Документ.НанесениеКодовМаркировкиСУЗИСМПТК КАК НанесениеКодовМаркировкиСУЗИСМПТК
		|ГДЕ
		|	НЕ НанесениеКодовМаркировкиСУЗИСМПТК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОтчетовСУЗИСМПТК.Отклонен)
		|	И НЕ НанесениеКодовМаркировкиСУЗИСМПТК.OrderID = &ПустаяСтрока";
		
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Результат = Запрос.Выполнить();
		
		ОтветСервера = Неопределено;
		
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				ОтветСервера = ИнтерфейсИСМПТК.ПолучитьСтатусНанесенияКМ(НастройкаОбменаСУЗ, Выборка.ВидПродукции, Выборка.OrderID);
				
				Если Не ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
					
					СтатусОтчета = ИнтерфейсИСМПТК.СтатусОбработкиОтчета(ОтветСервера.ДанныеОСтатусах["reportStatus"]);
					Если Не Выборка.Статус = СтатусОтчета Тогда 
						ДокументОбъект 		  = Выборка.Ссылка.ПолучитьОбъект();
						ДокументОбъект.Статус = СтатусОтчета;
						
						Попытка
							ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							ТекстСообщения = НСтр("ru = 'При записи документа ""%1"" произошла ошибка и документу не был присвоен изменённый статус ""%2""'");
							ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,
							ДокументОбъект,
							СтатусОтчета);
							
							ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения, "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
							
						КонецПопытки;
					КонецЕсли;
					
				Иначе
					
					ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не ОтветСервера = Неопределено Тогда
			Если ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
				ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки,  "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	ИнтеграцияИСМПТКПереопределяемый.ПриЗаполненииОграниченияДоступа(Ограничение, "НанесениеКодовМаркировкиСУЗИСМПТК");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли