
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстВопроса = НСтр("ru = 'Повторная печать кодов не рекомендуется!
		|Вы уверены, что хотите сбросить флаг печати по данному заказу?'");
	
	Если Не ПараметрыВыполненияКоманды.Источник.Элементы.СписокЗакрытые.ТекущиеДанные = Неопределено Тогда
		ПараметрыВыполнения = Новый Структура();
		ПараметрыВыполнения.Вставить("ЗаказДляСброса", ПараметрыВыполненияКоманды.Источник.Элементы.СписокЗакрытые.ТекущиеДанные.ЗаказНаЭмиссию);
		ПараметрыВыполнения.Вставить("ФормаЗаказа",    ПараметрыВыполненияКоманды.Источник);
		СброситьФлагПечатиПоЗаказуЗавершение = Новый ОписаниеОповещения("СброситьФлагПечатиПоЗаказуЗавершение", ПечатьКодовМаркировкиИСМПТККлиент, ПараметрыВыполнения);
		ПоказатьВопрос(СброситьФлагПечатиПоЗаказуЗавершение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не выбран Заказ!'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры