
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Временная заглушка
	ТекстИсключения = НСтр("ru='Форма объекта не предназначена для непосредственного открытия.'");
	ВызватьИсключение ТекстИсключения;
	
	//Список.Отбор.Элементы.Очистить();
	//
	//СтатусКарточки = Параметры.СтатусКарточки;
	//ЭлементОтбора  = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусКарточки");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = СтатусКарточки;
	//
	//Если Параметры.Свойство("Организация") Тогда 
	//	Организация   = Параметры.Организация;
	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = Организация;
	//КонецЕсли;

	//Если Параметры.Свойство("ВидПродукции") Тогда 
	//	ВидПродукции  = Параметры.ВидПродукции;
	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидПродукции");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = ВидПродукции;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеТовары = Элементы.Список.ВыделенныеСтроки;
	МассивТоваров = Новый Массив();
	
	Если Не ВыбранныеТовары.Количество() = 0 Тогда
		Для Каждого Строка Из ВыбранныеТовары Цикл
			ДанныеТовара = Новый Структура();
			ДанныеТовара.Вставить("Номенклатура", 	Строка.Номенклатура);
			ДанныеТовара.Вставить("Характеристика", Строка.Характеристика);
			ДанныеТовара.Вставить("Упаковка", 		Строка.ЕдиницаИзмерения);
			ДанныеТовара.Вставить("GTIN", 			Строка.GTIN);
			МассивТоваров.Добавить(ДанныеТовара);
		КонецЦикла;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(МассивТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ВыбранныйТовар  = Элементы.Список.ТекущиеДанные;
	
	МассивТоваров = Новый Массив();
	ДанныеТовара  = Новый Структура();
	ДанныеТовара.Вставить("Номенклатура", 	ВыбранныйТовар.Номенклатура);
	ДанныеТовара.Вставить("Характеристика", ВыбранныйТовар.Характеристика);
	ДанныеТовара.Вставить("Упаковка", 		ВыбранныйТовар.ЕдиницаИзмерения);
	ДанныеТовара.Вставить("GTIN", 			ВыбранныйТовар.GTIN);
	МассивТоваров.Добавить(ДанныеТовара);
	
	ЭтаФорма.Закрыть(МассивТоваров);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
