
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ ДоступноУдалениеЗаписи(ТекущиеДанные.СчетЗапасов, ТекущиеДанные.СпособОценки);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервереБезКонтекста
Функция ДоступноУдалениеЗаписи(СчетЗапасов, СпособОценки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
    |	ТиповойОбороты.Счет,
    |	ТиповойОбороты.СуммаОборотДт
    |ИЗ
    |	РегистрБухгалтерии.Типовой.Обороты(, , , Счет = &Счет, , , , ) КАК ТиповойОбороты";
	Запрос.УстановитьПараметр("Счет", СчетЗапасов);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя удалять способ оценки запасов, т.к. существуют проведенные документы.'");
	КонецЕсли;
	
	Объект = СчетЗапасов.ПолучитьОбъект();
	
	Субконто = Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Партии, "ВидСубконто");

	Если Субконто <> Неопределено Тогда
		Если СпособОценки = Перечисления.СпособыОценки.ЛИФО ИЛИ СпособОценки = Перечисления.СпособыОценки.ФИФО Тогда 

			Объект.ВидыСубконто.Удалить(Субконто);
			ТекстСообщения = НСтр("ru = 'Для счета %1 удалено субконто ""Партии""'");
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СчетЗапасов));

		КонецЕсли;
		Объект.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
