#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	

	
КонецПроцедуры

Функция ВариантыНастроек() Экспорт
	
    Результат = Новый Массив;
    Результат.Добавить(Новый Структура("Имя, Представление", "НаличиеРазвернутогоСальдо", НСтр("ru = 'Отрицательные остатки товаров на виртуальном складе по источникам происхождения'")));
    Результат.Добавить(Новый Структура("Имя, Представление", "НедостаточноТоваров", НСтр("ru = 'Недостаточно товаров на виртуальном складе'")));
	
    Возврат Результат;
	
КонецФункции

#КонецЕсли
