
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормыВыбора = Новый Структура();
	Отбор = Новый Структура();
	
	СписокЗависшихЗаказовСУЗ = ИнтеграцияИСМПТКВызовСервера.ПолучитьСписокЗависшихЗаказовСУЗ();
	Отбор.Вставить("Ссылка", СписокЗависшихЗаказовСУЗ);
	
	ПараметрыФормыВыбора.Вставить("Отбор", Отбор);
	ПараметрыФормыВыбора.Вставить("Заголовок", "Незавершенные Заказы на эмиссию кодов маркировки");
	ПараметрыФормыВыбора.Вставить("ЭтоСписокИсправления", Истина);
	
	ОткрытьФорму("Документ.ЗаказКодовМаркировкиСУЗИСМПТК.ФормаСписка", ПараметрыФормыВыбора);
	
КонецПроцедуры
