
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Операция") Тогда
		//Вызов происходит из формы ПоискНоменклатурыПоШтрихкоду командой ЗаполнитьДанныеВНесколькихСтроках,
		//данная форма работает по упрощенному сценарию.
		Операция = Параметры.Операция;
		ИспользоватьХарактеристикиНоменклатуры = ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристик();
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", "Видимость", ИспользоватьХарактеристикиНоменклатуры);
	КонецЕсли;
	
	ЗаполнитьДанныеФормыПриСозданииНаСервере();
	Если Не ЗначениеЗаполнено(Операция) Тогда
		ВывестиПоясняющийТекст();
	КонецЕсли;

	//Работа с двойным форматом
	УстановитьПризнакиДвойногоФорматаТранспортногоКода();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Штрихкоды = ЗаполнитьGTINПоНоменклатуре(Номенклатура);
		ЗаполнитьШтрихкодыВСтроке(Штрихкоды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()

	Если ЗначениеЗаполнено(Операция) Тогда
		
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформацияПоКоду",  "Видимость", 	Ложь);
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалятьAID", 			 "Видимость", 	Ложь);
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗавершитьРедактирование", "Доступность", Истина);
			
	Иначе	
		
		МожноПеренестиВДокумент = (Не Количество = 0) И ЗначениеЗаполнено(GTIN);
		ПоддержкаДвойногоФорматаТранспортногоКода = Константы.ПоддержкаДвойногоФорматаТранспортныхКодовИСМПТК.Получить();
		
		Если ПоддержкаДвойногоФорматаТранспортногоКода Тогда
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалятьAID", "Видимость", ВидУпаковки = Перечисления.ВидыУпаковокИСМПТК.Логистическая);
		Иначе
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалятьAID", "Видимость", Ложь);
		КонецЕсли;
		
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформацияПоКоду",  "Видимость", 	Истина);
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗавершитьРедактирование", "Доступность", МожноПеренестиВДокумент);
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", 		 "Видимость", 	Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПоясняющийТекст()
	
	МассивСтрок = Новый Массив;	
	Элементы.ПоясняющийТекст.Высота = 1;
	Если Не ПустаяСтрока(КодИдентификации) Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обработка кода маркировки: '") + КодИдентификации, Новый Шрифт(,,,,Истина), ЦветаСтиля.ЦветГиперссылкиИСМПТК));
	КонецЕсли;
	ПоясняющийТекст = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПриСозданииНаСервере()

	Если ЗначениеЗаполнено(Операция) Тогда
		
		Заголовок = НСтр("ru = 'Групповое редактирование строк'");
		
	Иначе
		
		Заголовок = НСтр("ru = 'Уточнение данных'");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураКодовМаркировки);
		
		Если Параметры.СтруктураКодовМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИСМПТК.Групповая Тогда
			EANВерхнегоУровня	 = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ШтрихкодEANИзGTIN(Параметры.СтруктураКодовМаркировки.GTINВерхнегоУровня);
			НоменклатураУпаковки = ИнтеграцияИСМПТКПереопределяемый.ПолучитьНоменклатуруПоШтрихкоду(EANВерхнегоУровня);
			Если ТипЗнч(НоменклатураУпаковки) = Тип("Структура") Тогда
				НоменклатураВерхнегоУровня = НоменклатураУпаковки.Номенклатура;
			Иначе
				НоменклатураВерхнегоУровня = НоменклатураУпаковки;
			КонецЕсли;
			
			ДанныеВложеннойНоменклатуры = ИнтеграцияИСМПТКПереопределяемый.ПолучитьНоменклатуруПоШтрихкоду(Параметры.СтруктураКодовМаркировки.EAN);
			Если ТипЗнч(ДанныеВложеннойНоменклатуры) = Тип("Структура") Тогда
				Номенклатура = ДанныеВложеннойНоменклатуры.Номенклатура;
			Иначе
				Номенклатура = ДанныеВложеннойНоменклатуры;
			КонецЕсли;
		Иначе
			Номенклатура = Параметры.Номенклатура;
		КонецЕсли;
		
		Организация	= Параметры.Организация;
		GTIN		= "";
		Количество  = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Операция) Тогда
		СтруктурыДанных = Новый Структура("EAN, GTIN, GTINВерхнегоУровня, ВидУпаковки, КодИдентификации, КодМаркировки, Количество, Номенклатура, Характеристика, ВидПродукцииИС");
		ЗаполнитьЗначенияСвойств(СтруктурыДанных, ЭтотОбъект,, "Номенклатура");
		Если Не ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Групповая") Тогда
			СтруктурыДанных.Номенклатура = Номенклатура; //Вложенная номенклатура
		Иначе
			СтруктурыДанных.Номенклатура = ?(ЗначениеЗаполнено(НоменклатураВерхнегоУровня), НоменклатураВерхнегоУровня, Номенклатура);
		КонецЕсли;
	Иначе
		СтруктурыДанных = Новый Структура("GTIN, Количество, Номенклатура, Характеристика");
		ЗаполнитьЗначенияСвойств(СтруктурыДанных, ЭтотОбъект);
	КонецЕсли;
	
	Закрыть(СтруктурыДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКлючАвторизации(СобытиеПослеАвторизации) Экспорт
	
	РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиент.ПолучитьКлючАвторизацииОбщая(СобытиеПослеАвторизации, Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеПолучитьДанныеПоГорупповымКодамМаркировки(РезультатВыполнения, Параметры) Экспорт
	
	ТокенАвторизации = ?(ЗначениеЗаполнено(РезультатВыполнения), РезультатВыполнения, Неопределено);
	
	СтруктураЗапрос = Новый Структура("Штрихкод, ВидУпаковки, ВидПродукции, ФорматBase64", КодИдентификации, ВидУпаковки, ВидПродукцииИС, Ложь);
	ДанныеПоГрупповомуКоду = ИнтерфейсИСМПТК.ЗапроситьДанныеОбАгрегацииКМ(СтруктураЗапрос, Организация, ТокенАвторизации);
	
	Если Не ЗначениеЗаполнено(ДанныеПоГрупповомуКоду.ТекстОшибки) Тогда
		
		СтруктураКода = ИнтеграцияИСМПТКВызовСервера.ПолучитьИнформациюПоГрупповомуКоду(ДанныеПоГрупповомуКоду, КодИдентификации, ВидУпаковки);
		
		//Подменим для группового кода GTIN на значение вложенной продукции и количествов соответствии с вложением
		GTIN 		   = СтруктураКода.GTIN;
		EAN 		   = СтруктураКода.EAN;
		Количество 	   = СтруктураКода.Количество;
		Номенклатура   = СтруктураКода.Номенклатура;
		Характеристика = СтруктураКода.Характеристика;
		
		Штрихкоды = ЗаполнитьGTINПоНоменклатуре(Номенклатура);
		ЗаполнитьШтрихкодыВСтроке(Штрихкоды);
		УправлениеФормой();
		
	Иначе 
		
		ТекстОшибки = НСтр("ru = 'Не удалось получить информацию по коду маркировки со стороны сервера.'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьGTINПоНоменклатуре(Номенклатура)
	
	ДанныеШтрихкодов = ИнтеграцияИСМПТКПереопределяемый.ПолучитьСписокВсехGTINНоменклатуры(Номенклатура);
	Возврат ДанныеШтрихкодов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШтрихкодыВСтроке(Штрихкоды)
	
	Если ЗначениеЗаполнено(GTIN) И ЗначениеЗаполнено(Операция) Тогда 
		//Вызов из формы подбора и регистрации, позволяем заполнить новый GTIN без привязки к имеющимся у ном-ры
		Возврат;
	КонецЕсли;
	
	Элементы.GTIN.СписокВыбора.Очистить();
	
	Если Штрихкоды.Количество() = 0 Тогда
		
		Элементы.GTIN.РежимВыбораИзСписка = Ложь;
		Элементы.GTIN.СписокВыбора.Очистить();
		
	ИначеЕсли Штрихкоды.Количество() = 1 Тогда
		
		Элементы.GTIN.РежимВыбораИзСписка = Ложь;
		GTIN = Штрихкоды[0].Значение;
		
	ИначеЕсли Штрихкоды.Количество() > 1 Тогда
		
		Элементы.GTIN.РежимВыбораИзСписка = Истина;
		Для Каждого НайднныйКод Из Штрихкоды Цикл 
			Элементы.GTIN.СписокВыбора.Добавить(НайднныйКод.Значение, НайднныйКод.Представление);
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
функция ПолучитьНоменклатуруПоШтрихкоду(EAN)
	
	Возврат ИнтеграцияИСМПТКПереопределяемый.ПолучитьНоменклатуруПоШтрихкоду(EAN);
	
КонецФункции

&НаКлиенте
Функция ПроверкаКорректностиПройденаУспешно()
	
	GTINКорректногоФормата = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ПроверитьКорректностьGTIN(GTIN);
	Если СтрДлина(GTIN) <> 14 Или Не GTINКорректногоФормата Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакиДвойногоФорматаТранспортногоКода()
	
	Если Константы.ПоддержкаДвойногоФорматаТранспортныхКодовИСМПТК.Получить()
		И СтрДлина(ЭтотОбъект.КодИдентификации) = 18 Тогда
		
		УдалятьAID = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ПроверкаКорректностиПройденаУспешно() Тогда
		ЗакрытьФорму();
	Иначе
		ТекстСообщения = НСтр("ru = 'Указанный GTIN не соответствует формату!'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьДанныеОбАгрегацииКодовМаркировки(Команда)
	
	ЗавершениеПолучитьДанныеПоГорупповымКодамМаркировки = Новый ОписаниеОповещения("ЗавершениеПолучитьДанныеПоГорупповымКодамМаркировки", ЭтаФорма);
	ПолучитьКлючАвторизации(ЗавершениеПолучитьДанныеПоГорупповымКодамМаркировки);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьAIDПриИзменении(Элемент)
	
 	Если УдалятьAID Тогда 
		КодИдентификации = Прав(КодИдентификации, 18);
	Иначе 
		КодИдентификации = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(КодМаркировки);
		
		//Если форма открывается с уже установленным признаком, преобразование выполняется иначе
		Если СтрДлина(КодИдентификации) = 18 Тогда
			КодИдентификации = "00" + КодИдентификации;
			КодМаркировки = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ШтрихкодВBase64(КодИдентификации);
		КонецЕсли;
	КонецЕсли;
	
	ВывестиПоясняющийТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)	
	
	Штрихкоды = ЗаполнитьGTINПоНоменклатуре(Номенклатура);
	ЗаполнитьШтрихкодыВСтроке(Штрихкоды);
	
	Если ЗначениеЗаполнено(Операция) Тогда
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", "Доступность", ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристикУНоменклатуры(Номенклатура));
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура GTINПриИзменении(Элемент)
	
	EAN = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ШтрихкодEANИзGTIN(GTIN);
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти
