Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002007Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Форма адаптирована к версии ЭФНО 1.6.1.29 от 07.08.2008г.";
	НоваяФорма.ДатаНачалоДействия = '20070101';
	НоваяФорма.ДатаКонецДействия  = '20071231';;
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002008Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Форма адаптирована к версии ЭФНО 1.6.1.41 от 13.02.2009г.";
	НоваяФорма.ДатаНачалоДействия = '20080101';
	НоваяФорма.ДатаКонецДействия  = '20081231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002009Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Форма адаптирована к версии ЭФНО 1.6.1.49 от 26.06.2009г.";
	НоваяФорма.ДатаНачалоДействия = '20090101';
	НоваяФорма.ДатаКонецДействия  = '20091231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002010Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v10.r70 от 28.11.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20100101';
	НоваяФорма.ДатаКонецДействия  = '20101231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002011Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v12.r77 от 14.01.2011 г.";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20111231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002012Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v13.r81";
	НоваяФорма.ДатаНачалоДействия = '20120101';
	НоваяФорма.ДатаКонецДействия  = '20121231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002013Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v14.r88";
	НоваяФорма.ДатаНачалоДействия = '20130101';
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002014Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v15.r95 от 31.12.2013 г.";
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v16.r106 от 01.05.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20150101';
	НоваяФорма.ДатаКонецДействия  = '20150630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002015Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v17.r108 от 04.07.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20150701';
	НоваяФорма.ДатаКонецДействия  = '20151231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002016Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v19.r113 от 13.08.2016 г.";
	НоваяФорма.ДатаНачалоДействия = '20160101';
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v19.r114 от 22.12.2016 г.";
	НоваяФорма.ДатаНачалоДействия = '20170101';
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v20.r116 от 14.04.2018 г.";
	НоваяФорма.ДатаНачалоДействия = '20180101';
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v20.r119 от 24.12.2019 г.";
	НоваяФорма.ДатаНачалоДействия = '20190101';
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v21.r123 от 11.01.2021 г.";
	НоваяФорма.ДатаНачалоДействия = '20200101';
	НоваяФорма.ДатаКонецДействия  = '20201231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002021Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v21.r124 от 23.12.2021 г.";
	НоваяФорма.ДатаНачалоДействия = '20210101';
	НоваяФорма.ДатаКонецДействия  = '20211231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма4002022Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по акцизу. Версия шаблона ФНО для ИС СОНО: 400.00.v22.r127 от 26.12.2023 г.";
	НоваяФорма.ДатаНачалоДействия = '20220101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

