#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002009Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Форма имеет возможность выгрузки в ИС СОНО 3.119.56, версия ФНО: 200.00.v17.r50 от 30.10.2009 г.";
	НоваяФорма.ДатаНачалоДействия = '20090101';
	НоваяФорма.ДатаКонецДействия  = '20091231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002010Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v19.r82 от 22.10.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20100101';
	НоваяФорма.ДатаКонецДействия  = '20101231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002011Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v20.r89 от 01.03.2011 г.";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20111231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002012Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v21.r98 от 21.12.2011 г.";
	НоваяФорма.ДатаНачалоДействия = '20120101';
	НоваяФорма.ДатаКонецДействия  = '20121231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002013Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v22.r104 от 29.05.2013 г.";
	НоваяФорма.ДатаНачалоДействия = '20130101';
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002014Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v23.r107 от 31.12.2013 г.";
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v24.r109 от 14.01.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20150101';
	НоваяФорма.ДатаКонецДействия  = '20151231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002016Кв2";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v26.r112 от 13.08.2016 г.";
	НоваяФорма.ДатаНачалоДействия = '20160101';
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002017Кв2";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v27.r117 от 08.06.2017 г.";
	НоваяФорма.ДатаНачалоДействия = '20170101';
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v28.r121 от 04.01.2019 г.";
	НоваяФорма.ДатаНачалоДействия = '20180101';
	НоваяФорма.ДатаКонецДействия  = '20181231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v29.r123 от 30.04.2019 г.";
	НоваяФорма.ДатаНачалоДействия = '20190101';
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002020Кв2";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v30.r130 от 21.12.2020 г.";
	НоваяФорма.ДатаНачалоДействия = '20200101';
	НоваяФорма.ДатаКонецДействия  = '20201231';
    
   	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002021Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v31.r134 от 23.12.2021 г.";
	НоваяФорма.ДатаНачалоДействия = '20210101';
	НоваяФорма.ДатаКонецДействия  = '20220630';
    
   	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002022Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v32.r136 от 22.12.2022 г.";
	НоваяФорма.ДатаНачалоДействия = '20220701';
	НоваяФорма.ДатаКонецДействия  = '20221231';  
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2002023Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версия шаблона ФНО для ИС СОНО: 200.00.v33.r138 от 26.12.2023 г.";
	НоваяФорма.ДатаНачалоДействия = '20230101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	Возврат ТаблицаФормОтчета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли