#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
		Если СтрокаНабораЗаписей.Валюта = ВалютаРегламентированногоУчета Тогда 
			Если СтрокаНабораЗаписей.Кратность <> 1 ИЛИ СтрокаНабораЗаписей.Курс <> 1 Тогда 
				Текст = НСтр("ru = 'В поле кратность или курс введено ошибочное значение, значение должно быть равным ""1""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "Кратность", "Запись");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
