#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьКоэффициентыДляОСМС() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	НаборЗаписей.Отбор.Организация.ВидСравнения	 = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Значение	 	 = Справочники.Организации.ПустаяСсылка();
	
	// Взносы ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Отчисления ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентыДляОПВР() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	НаборЗаписей.Отбор.Организация.ВидСравнения	 = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Значение	 	 = Справочники.Организации.ПустаяСсылка();
	
	// ОПВР
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20240101';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя;
	НоваяЗапись.Коэффициент = 1.25;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
