////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

    Если ЗначениеЗаполнено(ДанныеСтроки.Период) Тогда
    	ДатаСреза = ДанныеСтроки.Период - 86400;
    Иначе
    	// если это запись с пустым периодом, ее точно удалять нельзя
    	Отказ = Истина;
    	Возврат;
    КонецЕсли;
    
    Если ОднаСтрокаПоВалюте(ДанныеСтроки.Валюта, ДатаСреза) Тогда
    	// это строка с первой записью о курсе и кратности для валюты, ее удалять нельзя
    	Отказ = Истина;
    КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)

	ОткрытьФорму("Обработка.ЗагрузкаКурсовВалют.Форма");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ОднаСтрокаПоВалюте(Валюта, ДатаСреза)
	
	Возврат РегистрыСведений.КурсыВалют.СрезПоследних(ДатаСреза, Новый Структура("Валюта", Валюта)).Количество() = 0;
	
КонецФункции

