
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//заполним параметры динамического списка
	ОтборНалогоплательщик = ОбщегоНазначенияБК.ПолучитьОрганизациюПоУмолчанию(Ложь, Пользователи.ТекущийПользователь(),
																			Истина, ПолныеПраваПовтИсп.ЗаполнитьИсчислениеНалоговСтруктурныхЕдиниц(), 
																			Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Налогоплательщик", ОтборНалогоплательщик);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ПустаяДата", Дата(1,1,1));
	
	Если Не ЗначениеЗаполнено(Год) Тогда
		ОтборРабочаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
		
		НачПериода  = НачалоГода(ОтборРабочаяДата);
		КонПериода = КонецГода(ОтборРабочаяДата);
		
		Год = Год(ОтборРабочаяДата);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НачПериода", НачПериода);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КонПериода", КонПериода);

	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборНалогоплательщикПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Налогоплательщик", ОтборНалогоплательщик);
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Год) И Год > 0 Тогда
		ДатаВГоду = Дата("" + Прав("0000" + Формат(Год , "ЧГ=0"), 4) + "0101");
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НачПериода", НачалоГода(ДатаВГоду));
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КонПериода", КонецГода(ДатаВГоду));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НачПериода", Дата(1,1,1));
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КонПериода", Дата(1,1,1));
	КонецЕсли;	
		        	
КонецПроцедуры

