#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаСведенийВОВ Из ЭтотОбъект Цикл
		
		Если СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ИнвалидВОВ
			И СтрокаСведенийВОВ.Период >= Дата(2020, 5, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Категория ""Лицо с инвалидностью ВОВ (до мая 2020)"" используется до мая 2020 года'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		ИначеЕсли (СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныБоевыхДействийНаТерриторииДругихГосударств
			ИЛИ СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныТруда)
			И СтрокаСведенийВОВ.Период < Дата(2020, 5, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Категории ""Ветераны боевых действий на территории других государств"", ""Ветераны труда"" используются с мая 2020 года'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли