#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьПравоДоступаКНастройкам() Тогда
		ОткрытьФорму(
			"Обработка.ПанельАдминистрированияИСМПТК.Форма.РабочееМестоНастройкиИСМП",
			Новый Структура,
			ПараметрыВыполненияКоманды.Источник,
			"Обработка.ПанельАдминистрированияИСМПТК.Форма.РабочееМестоНастройкиИСМП" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
			ПараметрыВыполненияКоманды.Окно);
	Иначе
		ТекстСообщения = НСтр("ru='Недостаточно прав для открытия формы обработки! Обратитесь к администратору системы.'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьПравоДоступаКНастройкам()
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ПанельАдминистрированияИСМПТК);
	
КонецФункции

#КонецОбласти