
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЭтаФорма.Заголовок = НСтр("Карт-счет физ. лица: ") + Объект.Владелец.Наименование;  	

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ЭтаФорма.Заголовок = НСтр("Карт-счет физ. лица: ") + Объект.Владелец.Наименование;  	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НеЯвляетсяВладельцемСчетаПриИзменении(Элемент)
	
	Если НЕ Объект.НеЯвляетсяВладельцемСчета Тогда
		Объект.Фамилия   = "";
		Объект.Имя		 = "";
		Объект.Отчество  = "";
		Объект.РНН		 = "";
		Объект.ИдентификационныйКодЛичности = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	Объект.Наименование = УправлениеДенежнымиСредствамиКлиентСервер.СформироватьНаименованиеКартСчета(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	Объект.Наименование = УправлениеДенежнымиСредствамиКлиентСервер.СформироватьНаименованиеКартСчета(Объект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПроверитьИИН(Команда)
	
	СообщенияПроверки = "";
	РегламентированныеДанныеКлиентСервер.ИИНБИНСоответствуетТребованиям(Объект.ИдентификационныйКодЛичности, СообщенияПроверки);
	ОбщегоНазначенияКлиент.СообщитьПользователю(СообщенияПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРНН(Команда)
	
	СообщенияПроверки = "";
	РегламентированныеДанныеКлиентСервер.РННСоответствуетТребованиям(Объект.РНН, СообщенияПроверки);
	ОбщегоНазначенияКлиент.СообщитьПользователю(СообщенияПроверки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.РНН.Доступность 				 			= Объект.НеЯвляетсяВладельцемСчета;
	Элементы.ПроверитьИИН.Доступность  					= Объект.НеЯвляетсяВладельцемСчета;
	Элементы.ПроверитьРНН.Доступность 				 	= Объект.НеЯвляетсяВладельцемСчета;
	Элементы.ИдентификационныйКодЛичности.Доступность   = Объект.НеЯвляетсяВладельцемСчета;
	Элементы.Фамилия.Доступность 						= Объект.НеЯвляетсяВладельцемСчета;
	Элементы.Имя.Доступность   							= Объект.НеЯвляетсяВладельцемСчета;
	Элементы.Отчество.Доступность 				 		= Объект.НеЯвляетсяВладельцемСчета;
	
КонецПроцедуры // УстановитьДоступность()
