
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СписокИсключений = Новый Массив;
	Если Параметры.Свойство("ЕжемесячныйРасчетВзносовИОтчисленийЗаИП") И Не Параметры.ЕжемесячныйРасчетВзносовИОтчисленийЗаИП Тогда
		СписокИсключений.Добавить(Перечисления.ВидыОперацийРегистрацияПрочихДоходов.ДоходыИП);
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыОперацийРегистрацияПрочихДоходов Цикл
		Если СписокИсключений.Найти(ЗначениеПеречисления) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры
