Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);

	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002006Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Форма адаптирована к версии НДС 1.6.1.17 от 30.09.2008г.";
	НоваяФорма.ДатаНачалоДействия = '20060101';
	НоваяФорма.ДатаКонецДействия  = '20061231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002007Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Форма адаптирована к версии НДС 1.6.1.17 от 30.09.2008г.";
	НоваяФорма.ДатаНачалоДействия = '20070101';
	НоваяФорма.ДатаКонецДействия  = '20071231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002008Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Форма адаптирована к версии НДС 1.6.1.21 от 03.02.2009г.";
	НоваяФорма.ДатаНачалоДействия = '20080101';
	НоваяФорма.ДатаКонецДействия  = '20081231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002009Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Форма имеет возможность выгрузки в ИС СОНО 3.119.56, версия ФНО: 300.00.v10.r22 от 29.07.2009 г.";
	НоваяФорма.ДатаНачалоДействия = '20090101';
	НоваяФорма.ДатаКонецДействия  = '20091231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002010Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Форма имеет возможность выгрузки в ИС СОНО 3.119.99, версия ФНО: 300.00.v13.r70 от 30.04.2010 г.";
	НоваяФорма.ДатаНачалоДействия = '20100101';
	НоваяФорма.ДатаКонецДействия  = '20100630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002010Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v14.r84 от 05.10.2010 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20100701';
	НоваяФорма.ДатаКонецДействия  = '20101231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002011Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v15.r89 от 21.02.2011 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20111231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002012Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v16.r108 от 30.05.2012 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20120101';
	НоваяФорма.ДатаКонецДействия  = '20121231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002013Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v17.r117 от 27.12.2012 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20130101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002014Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v18.r122 от 31.12.2013 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20140101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v19.r127 от 09.07.2015 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20150101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20150630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002015Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v20.r130 от 06.11.2015 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20150701';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20151231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002016Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v21.r131 от 24.12.2015 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20160101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v22.r132 от 29.12.2016 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20170101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v24.r140 от 26.12.2018 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20180101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002019Кв2";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v25.r143 от 27.06.2019 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20190101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002020Кв2";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v26.r152 от 29.12.2020 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20200101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20201231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002021Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v27.r155 от 23.12.2021 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20210101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20211231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002022Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v28.r158 от 22.12.2022 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20220101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20221231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма3002023Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по налогу на добавленную стоимость. Версия шаблона ФНО для ИС СОНО: 300.00.v29.r165 от 26.12.2023 г."; //Форма имеет возможность выгрузки в ИС СОНО х.ххх.хх, версия ФНО: 300.00.vхх.rхх от хх.хх.хххх г.";
	НоваяФорма.ДатаНачалоДействия = '20230101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

