
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Для Каждого ВидКомандИС Из ПодключаемоеОборудованиеИСМПТККлиентСервер.ВидыПодключаемыхКоманд() Цикл
		
		Вид = ВидыПодключаемыхКоманд.Добавить();
		ЗаполнитьЗначенияСвойств(Вид,ВидКомандИС);
		Вид.ВидГруппыФормы = ВидГруппыФормы.Подменю;
		Вид.Картинка       = Новый Картинка;
		Вид.Отображение    = ОтображениеКнопки.Текст;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
#Область ОпределениеКомандДляУправленияВидимостью
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"ВидимостьПодключаемыхКоманд") = Ложь Тогда 
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВидимостьПодключаемыхКоманд",Новый ОписаниеТипов));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Форма.ВидимостьПодключаемыхКоманд = Новый Структура;
	КонецЕсли;
#КонецОбласти
	
#Область ДоработкаПослеБСП
	Для Каждого ВидКомандИС Из ПодключаемоеОборудованиеИСМПТККлиентСервер.ВидыПодключаемыхКоманд() Цикл
		Если Форма.Элементы[ВидКомандИС.ИмяПодменю].Вид = ВидГруппыФормы.ГруппаКнопок Тогда
			Форма.Элементы[ВидКомандИС.ИмяПодменю].Вид = ВидГруппыФормы.Подменю;
			Форма.Элементы[ВидКомандИС.ИмяПодменю].ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
		КонецЕсли;
	КонецЦикла;
#КонецОбласти
	
КонецПроцедуры
