#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодборМаркируемойПродукции = Параметры.ИспользоватьПодборМаркируемойПродукции;
	ИспользуетсяРегистрацияРозничныхПродажВЕГАИС = Параметры.ИспользуетсяРегистрацияРозничныхПродажВЕГАИС; 
	
	ИмяТаблицы = Неопределено;
	Если Параметры.Свойство("ИмяТаблицы") Тогда 
		//В документе УстановкаЦенНоменклатуры одна табличная часть для товаров и услуг 
		Если Параметры.Свойство("ИмяФормы") И Параметры.ИмяФормы = "Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента" Тогда
			ИмяТаблицы = Неопределено; 
		Иначе 
			ИмяТаблицы = Параметры.ИмяТаблицы;
		КонецЕсли;
	Иначе
		Если Параметры.Свойство("ИмяФормы") И Параметры.ИмяФормы = "Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента" Тогда
			ИмяТаблицы = Неопределено;  
		Иначе 
			ИмяТаблицы = "Товары";
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШтрихкодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ДанныеВыбораНаСервере(Текст, ИспользоватьПодборМаркируемойПродукции,ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	Результат = ДанныеВыбораПоШтрихкодуНаСервере(Штрихкод, 
		ИспользоватьПодборМаркируемойПродукции, ИспользуетсяРегистрацияРозничныхПродажВЕГАИС);
		
	Если НЕ Результат.Номенклатура.Пустая() И Открыта() Тогда
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	ДанныеВыбора = ДанныеВыбораПоШтрихкодуНаСервере(Штрихкод, ИспользоватьПодборМаркируемойПродукции, ИспользуетсяРегистрацияРозничныхПродажВЕГАИС);
	
	Результат = Неопределено;
	Если НЕ ДанныеВыбора.Номенклатура.Пустая() Тогда
		ДанныеЗакрытия = Результат;
	КонецЕсли;
	
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеВыбораНаСервере(Текст, ИспользоватьПодборМаркируемойПродукции, ИмяТаблицы=Неопределено)
	ДанныеВыбора = Новый СписокЗначений;
	
	НоменклатураПоШтрихкоду = РегистрыСведений.ШтрихкодыНоменклатуры.НоменклатураПоШтрихкоду(Текст); 
	
	Если ИмяТаблицы = Неопределено Тогда
		Для каждого СтрокаНоменклатуры Из НоменклатураПоШтрихкоду Цикл
			ДанныеВыбора.Добавить(СтрокаНоменклатуры.Штрихкод, СтрокаНоменклатуры.Представление);
		КонецЦикла;
	Иначе 
		Для каждого СтрокаНоменклатуры Из НоменклатураПоШтрихкоду Цикл
			Если СтрокаНоменклатуры.Номенклатура.Услуга Тогда 					
				Если ИмяТаблицы = "Товары" Тогда 						
					Продолжить; 	
				Иначе
					ДанныеВыбора.Добавить(СтрокаНоменклатуры.Штрихкод, СтрокаНоменклатуры.Представление);
				КонецЕсли;  					
			Иначе
				
				Если ИмяТаблицы = "Услуги" Тогда 						
					Продолжить; 			
				Иначе
					ДанныеВыбора.Добавить(СтрокаНоменклатуры.Штрихкод, СтрокаНоменклатуры.Представление);
				КонецЕсли;     					
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
		
	//Если ИспользоватьПодборМаркируемойПродукции Тогда
	//	НомераКиз = Справочники.КонтрольныеЗнакиГИСМ.ПодобратьКИЗ_ГИСМПоШтрихкоду(Текст);
	//	Для каждого НомерКиз Из НомераКиз Цикл
	//		ДанныеВыбора.Добавить(НомерКиз.Штрихкод, НомерКиз.Представление);
	//	КонецЦикла;
	//КонецЕсли;
	
	Возврат ДанныеВыбора;

КонецФункции 

&НаСервереБезКонтекста
Функция НовыйРезультатВыбора(Штрихкод)
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Штрихкод",                Штрихкод);
	РезультатВыбора.Вставить("Номенклатура",            Справочники.Номенклатура.ПустаяСсылка());
	//РезультатВыбора.Вставить("ЭтоАлкогольнаяПродукция", Ложь);
	//РезультатВыбора.Вставить("КИЗ_ГИСМ",                Неопределено);
	
	Возврат РезультатВыбора;

КонецФункции 

&НаСервереБезКонтекста
Функция ДанныеВыбораПоШтрихкодуНаСервере(Штрихкод, ИспользоватьПодборМаркируемойПродукции, ИспользуетсяРегистрацияРозничныхПродажВЕГАИС)
	РезультатВыбора = НовыйРезультатВыбора(Штрихкод);
	
	//Если  ИспользоватьПодборМаркируемойПродукции Тогда
	//	И ИнтеграцияГИСМКлиентСервер.ЭтоНомерКиЗ(Штрихкод) Тогда
	//	
	//	ДанныеКиЗ = Справочники.КонтрольныеЗнакиГИСМ.ДанныеКИЗ_ГИСМПоНомеру(Штрихкод);
	//	Если соответствия нет -вводи вручную, выбрав номенклатуру
	//	Если ДанныеКиЗ <> Неопределено Тогда
	//		РезультатВыбора.Вставить("Номенклатура", ДанныеКиЗ.Владелец);
	//		РезультатВыбора.Вставить("КИЗ_ГИСМ",     ДанныеКиЗ.КИЗ_ГИСМ);
	//	КонецЕсли;
	//Иначе
	//	РезультатПоискаПоШтрихкодуЕГАИС = ?(ИспользуетсяРегистрацияРозничныхПродажВЕГАИС, 
	//			ШтрихкодированиеНоменклатурыЕГАИСПереопределяемый.НайтиПоШтрихкоду(Штрихкод), 
	//			Неопределено);
	//			
	//	Если РезультатПоискаПоШтрихкодуЕГАИС <> Неопределено
	//		И РезультатПоискаПоШтрихкодуЕГАИС.МаркируемаяПродукция Тогда
	//		
	//		РезультатВыбора.Вставить("Номенклатура",            РезультатПоискаПоШтрихкодуЕГАИС.Номенклатура);
	//		РезультатВыбора.Вставить("ЭтоАлкогольнаяПродукция", Истина);
	//	Иначе
			ТаблицаНоменклатуры = РегистрыСведений.ШтрихкодыНоменклатуры.НоменклатураПоШтрихкоду(Штрихкод);
			
			Если ТаблицаНоменклатуры.Количество() = 1 Тогда
				РезультатВыбора.Вставить("Номенклатура", ТаблицаНоменклатуры[0].Номенклатура);
			КонецЕсли; 
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат РезультатВыбора;
КонецФункции

#КонецОбласти 



