
// Устанавливает свойство ИмяСвойства элемента формы с именем ИмяЭлемента в значение Значение.
// Применяется в тех случаях, когда элемент формы может не быть на форме из-за отсутствия прав у пользователя
// на объект, реквизит объекта или команду.
//
// Параметры:
//  ЭлементыФормы - свойство ЭлементыФормы управляемой формы.
//  ИмяЭлемента - Строка - имя элемента формы
//  ИмяСвойства - Строка - имя устанавливаемого свойства элемента формы
//  Значение - Произвольный - новое значение элемента
// 
Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение) Экспорт
    
    РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение);
    
КонецПроцедуры

// Определяет индекс картинки типа упаковки для строки дерева маркируемой продукции.
// 
// Параметры:
// 	ТекущаяСтрока - ДанныеФормыЭлементДерева - строка дерева, содержащая данные упаковки или маркируемой продукции.
//
Процедура УстановитьИндексКартинкиТипаУпаковки(ТекущаяСтрока) Экспорт
	
	ВидУпаковки = ТекущаяСтрока.ВидУпаковки;
	ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.ПустаяСсылка");
	Попытка
		ВидПродукцииИС = ТекущаяСтрока.ВидПродукцииИС;
	Исключение
	КонецПопытки;
	
	Если ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Потребительская") Тогда
		Если ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Обувная") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 7;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Табачная") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 1;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Алкогольная") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 11;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.БезалкогольныеНапитки") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 15;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.ЛегкаяПромышленность") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 13;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.МолочнаяПродукция") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 9;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.ЛекарственныеПрепараты") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 17;
		Иначе
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 6;
		КонецЕсли;
		
	ИначеЕсли ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Групповая") Тогда
		
		Если ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Обувная") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 8;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Табачная") Тогда 
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 2;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.Алкогольная") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 12;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.БезалкогольныеНапитки") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 16;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.ЛегкаяПромышленность") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 14;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.МолочнаяПродукция") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 10;
		ИначеЕсли ВидПродукцииИС = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИСМПТК.ЛекарственныеПрепараты") Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 18;
		Иначе
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 6;
		КонецЕсли;
			
	ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИСМПТК.Логистическая") Тогда
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 0;
		
	Иначе
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 6;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьИндексКартинкиСостояниеСтрокиКМ(ТекущаяСтрока, Организация) Экспорт
	
	ТекущийВладелец			= ТекущаяСтрока.Владелец;
	ВыполненЗапросВладельца = ТекущаяСтрока.ВыполненЗапросВладельца;
	
	Если ВыполненЗапросВладельца И ТекущийВладелец = Организация Тогда
		ТекущаяСтрока.ИндексКартинкиСостояниеСтроки = 1;
	ИначеЕсли ВыполненЗапросВладельца Тогда
		ТекущаяСтрока.ИндексКартинкиСостояниеСтроки = 2;
	Иначе
		ТекущаяСтрока.ИндексКартинкиСостояниеСтроки = 0;
	КонецЕсли;
		
КонецПроцедуры
