#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах'");
	НоваяФорма.ДатаНачалоДействия = '20000101';
	НоваяФорма.ДатаКонецДействия  = '20131231';  

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах'");
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20150531';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах'");
	НоваяФорма.ДатаНачалоДействия = '20150601';
	НоваяФорма.ДатаКонецДействия  = '20160229';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах'");
	НоваяФорма.ДатаНачалоДействия = '20160301';
	НоваяФорма.ДатаКонецДействия  = '20180630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв3"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах'");
	НоваяФорма.ДатаНачалоДействия = '20180701';
	НоваяФорма.ДатаКонецДействия  = '20211031';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2021Кв1"; 
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Справка о суммах дохода, выплаченного физическому лицу и осуществленных с дохода обязательных пенсионных взносах (внесены изменения приказом №424 от 16.11.2021)'");
	НоваяФорма.ДатаНачалоДействия = '20211101';
	НоваяФорма.ДатаКонецДействия  = '00010101';

	Возврат ТаблицаФормОтчета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
